Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
<?xml version="1.0" encoding="UTF-8" standalone="no"?><device schemaVersion="1.3"><name>STM32F405RGT6</name><version>0.1.0</version><description>HAIR extraction for the STM32F405RGT6 in the Olimex STM32-H405 board context, with Embassy HAL profile coverage limited to the evidence-defended first-cut subset.</description><vendor>STMicroelectronics</vendor><addressUnitBits>8</addressUnitBits><width>32</width><cpu><name>Cortex-M4</name><revision>r0p1</revision><endian>little</endian><mpuPresent>true</mpuPresent><fpuPresent>true</fpuPresent><fpuDP>false</fpuDP><dspPresent>true</dspPresent><vtorPresent>true</vtorPresent><nvicPrioBits>4</nvicPrioBits><vendorSystickConfig>false</vendorSystickConfig></cpu><peripherals><peripheral><name>RNG</name><description>Random number generator</description><baseAddress>0x50060800</baseAddress><groupName>RNG</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>FPU</name><value>81</value></interrupt><interrupt><name>RNG</name><value>80</value></interrupt><registers><register><name>CR</name><description>control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>IE</name><description>Interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RNGEN</name><description>Random number generator enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>SR</name><description>status register</description><addressOffset>0x4</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SEIS</name><description>Seed error interrupt status</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CEIS</name><description>Clock error interrupt status</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SECS</name><description>Seed error current status</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CECS</name><description>Clock error current status</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DRDY</name><description>Data ready</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DR</name><description>data register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RNDATA</name><description>Random data</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral><name>DBGMCU</name><description>Debug support</description><baseAddress>0xE0042000</baseAddress><groupName>DBG</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>DBGMCU_IDCODE</name><description>IDCODE</description><addressOffset>0x0</addressOffset><size>32</size><access>read-only</access><resetValue>0x10006411</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DEV_ID</name><description>DEV_ID</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-only</access></field><field><name>REV_ID</name><description>REV_ID</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>DBGMCU_CR</name><description>Control Register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DBG_SLEEP</name><description>DBG_SLEEP</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_STOP</name><description>DBG_STOP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_STANDBY</name><description>DBG_STANDBY</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRACE_IOEN</name><description>TRACE_IOEN</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRACE_MODE</name><description>TRACE_MODE</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DBG_I2C2_SMBUS_TIMEOUT</name><description>DBG_I2C2_SMBUS_TIMEOUT</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM8_STOP</name><description>DBG_TIM8_STOP</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM5_STOP</name><description>DBG_TIM5_STOP</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM6_STOP</name><description>DBG_TIM6_STOP</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM7_STOP</name><description>DBG_TIM7_STOP</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DBGMCU_APB1_FZ</name><description>Debug MCU APB1 Freeze registe</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DBG_TIM2_STOP</name><description>DBG_TIM2_STOP</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM3_STOP</name><description>DBG_TIM3 _STOP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM4_STOP</name><description>DBG_TIM4_STOP</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM5_STOP</name><description>DBG_TIM5_STOP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM6_STOP</name><description>DBG_TIM6_STOP</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM7_STOP</name><description>DBG_TIM7_STOP</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM12_STOP</name><description>DBG_TIM12_STOP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM13_STOP</name><description>DBG_TIM13_STOP</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM14_STOP</name><description>DBG_TIM14_STOP</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_WWDG_STOP</name><description>DBG_WWDG_STOP</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_IWDEG_STOP</name><description>DBG_IWDEG_STOP</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_J2C1_SMBUS_TIMEOUT</name><description>DBG_J2C1_SMBUS_TIMEOUT</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_J2C2_SMBUS_TIMEOUT</name><description>DBG_J2C2_SMBUS_TIMEOUT</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_J2C3SMBUS_TIMEOUT</name><description>DBG_J2C3SMBUS_TIMEOUT</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_CAN1_STOP</name><description>DBG_CAN1_STOP</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_CAN2_STOP</name><description>DBG_CAN2_STOP</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DBGMCU_APB2_FZ</name><description>Debug MCU APB2 Freeze registe</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DBG_TIM1_STOP</name><description>TIM1 counter stopped when core is halted</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM8_STOP</name><description>TIM8 counter stopped when core is halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM9_STOP</name><description>TIM9 counter stopped when core is halted</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM10_STOP</name><description>TIM10 counter stopped when core is halted</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBG_TIM11_STOP</name><description>TIM11 counter stopped when core is halted</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>DMA2</name><description>DMA controller</description><baseAddress>0x40026400</baseAddress><groupName>DMA</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>DMA2_Stream0</name><value>56</value></interrupt><interrupt><name>DMA2_Stream1</name><value>57</value></interrupt><interrupt><name>DMA2_Stream2</name><value>58</value></interrupt><interrupt><name>DMA2_Stream3</name><value>59</value></interrupt><interrupt><name>DMA2_Stream4</name><value>60</value></interrupt><interrupt><name>DMA2_Stream5</name><value>68</value></interrupt><interrupt><name>DMA2_Stream6</name><value>69</value></interrupt><interrupt><name>DMA2_Stream7</name><value>70</value></interrupt><registers><register><name>LISR</name><description>low interrupt status register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TCIF3</name><description>Stream x transfer complete interrupt flag (x = 3..0)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF3</name><description>Stream x half transfer interrupt flag (x=3..0)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF3</name><description>Stream x transfer error interrupt flag (x=3..0)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF3</name><description>Stream x direct mode error interrupt flag (x=3..0)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF3</name><description>Stream x FIFO error interrupt flag (x=3..0)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCIF2</name><description>Stream x transfer complete interrupt flag (x = 3..0)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF2</name><description>Stream x half transfer interrupt flag (x=3..0)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF2</name><description>Stream x transfer error interrupt flag (x=3..0)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF2</name><description>Stream x direct mode error interrupt flag (x=3..0)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF2</name><description>Stream x FIFO error interrupt flag (x=3..0)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCIF1</name><description>Stream x transfer complete interrupt flag (x = 3..0)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF1</name><description>Stream x half transfer interrupt flag (x=3..0)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF1</name><description>Stream x transfer error interrupt flag (x=3..0)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF1</name><description>Stream x direct mode error interrupt flag (x=3..0)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF1</name><description>Stream x FIFO error interrupt flag (x=3..0)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCIF0</name><description>Stream x transfer complete interrupt flag (x = 3..0)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF0</name><description>Stream x half transfer interrupt flag (x=3..0)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF0</name><description>Stream x transfer error interrupt flag (x=3..0)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF0</name><description>Stream x direct mode error interrupt flag (x=3..0)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF0</name><description>Stream x FIFO error interrupt flag (x=3..0)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>HISR</name><description>high interrupt status register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TCIF7</name><description>Stream x transfer complete interrupt flag (x=7..4)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF7</name><description>Stream x half transfer interrupt flag (x=7..4)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF7</name><description>Stream x transfer error interrupt flag (x=7..4)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF7</name><description>Stream x direct mode error interrupt flag (x=7..4)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF7</name><description>Stream x FIFO error interrupt flag (x=7..4)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCIF6</name><description>Stream x transfer complete interrupt flag (x=7..4)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF6</name><description>Stream x half transfer interrupt flag (x=7..4)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF6</name><description>Stream x transfer error interrupt flag (x=7..4)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF6</name><description>Stream x direct mode error interrupt flag (x=7..4)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF6</name><description>Stream x FIFO error interrupt flag (x=7..4)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCIF5</name><description>Stream x transfer complete interrupt flag (x=7..4)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF5</name><description>Stream x half transfer interrupt flag (x=7..4)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF5</name><description>Stream x transfer error interrupt flag (x=7..4)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF5</name><description>Stream x direct mode error interrupt flag (x=7..4)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF5</name><description>Stream x FIFO error interrupt flag (x=7..4)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCIF4</name><description>Stream x transfer complete interrupt flag (x=7..4)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HTIF4</name><description>Stream x half transfer interrupt flag (x=7..4)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TEIF4</name><description>Stream x transfer error interrupt flag (x=7..4)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DMEIF4</name><description>Stream x direct mode error interrupt flag (x=7..4)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FEIF4</name><description>Stream x FIFO error interrupt flag (x=7..4)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>LIFCR</name><description>low interrupt flag clear register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CTCIF3</name><description>Stream x clear transfer complete interrupt flag (x = 3..0)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF3</name><description>Stream x clear half transfer interrupt flag (x = 3..0)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF3</name><description>Stream x clear transfer error interrupt flag (x = 3..0)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF3</name><description>Stream x clear direct mode error interrupt flag (x = 3..0)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF3</name><description>Stream x clear FIFO error interrupt flag (x = 3..0)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTCIF2</name><description>Stream x clear transfer complete interrupt flag (x = 3..0)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF2</name><description>Stream x clear half transfer interrupt flag (x = 3..0)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF2</name><description>Stream x clear transfer error interrupt flag (x = 3..0)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF2</name><description>Stream x clear direct mode error interrupt flag (x = 3..0)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF2</name><description>Stream x clear FIFO error interrupt flag (x = 3..0)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTCIF1</name><description>Stream x clear transfer complete interrupt flag (x = 3..0)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF1</name><description>Stream x clear half transfer interrupt flag (x = 3..0)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF1</name><description>Stream x clear transfer error interrupt flag (x = 3..0)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF1</name><description>Stream x clear direct mode error interrupt flag (x = 3..0)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF1</name><description>Stream x clear FIFO error interrupt flag (x = 3..0)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTCIF0</name><description>Stream x clear transfer complete interrupt flag (x = 3..0)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF0</name><description>Stream x clear half transfer interrupt flag (x = 3..0)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF0</name><description>Stream x clear transfer error interrupt flag (x = 3..0)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF0</name><description>Stream x clear direct mode error interrupt flag (x = 3..0)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF0</name><description>Stream x clear FIFO error interrupt flag (x = 3..0)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>HIFCR</name><description>high interrupt flag clear register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CTCIF7</name><description>Stream x clear transfer complete interrupt flag (x = 7..4)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF7</name><description>Stream x clear half transfer interrupt flag (x = 7..4)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF7</name><description>Stream x clear transfer error interrupt flag (x = 7..4)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF7</name><description>Stream x clear direct mode error interrupt flag (x = 7..4)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF7</name><description>Stream x clear FIFO error interrupt flag (x = 7..4)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTCIF6</name><description>Stream x clear transfer complete interrupt flag (x = 7..4)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF6</name><description>Stream x clear half transfer interrupt flag (x = 7..4)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF6</name><description>Stream x clear transfer error interrupt flag (x = 7..4)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF6</name><description>Stream x clear direct mode error interrupt flag (x = 7..4)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF6</name><descri