Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
ption>Stream x clear FIFO error interrupt flag (x = 7..4)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTCIF5</name><description>Stream x clear transfer complete interrupt flag (x = 7..4)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF5</name><description>Stream x clear half transfer interrupt flag (x = 7..4)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF5</name><description>Stream x clear transfer error interrupt flag (x = 7..4)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF5</name><description>Stream x clear direct mode error interrupt flag (x = 7..4)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF5</name><description>Stream x clear FIFO error interrupt flag (x = 7..4)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTCIF4</name><description>Stream x clear transfer complete interrupt flag (x = 7..4)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHTIF4</name><description>Stream x clear half transfer interrupt flag (x = 7..4)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTEIF4</name><description>Stream x clear transfer error interrupt flag (x = 7..4)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CDMEIF4</name><description>Stream x clear direct mode error interrupt flag (x = 7..4)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CFEIF4</name><description>Stream x clear FIFO error interrupt flag (x = 7..4)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S0CR</name><description>stream x configuration register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S0NDTR</name><description>stream x number of data register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S0PAR</name><description>stream x peripheral address register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S0M0AR</name><description>stream x memory 0 address register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S0M1AR</name><description>stream x memory 1 address register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S0FCR</name><description>stream x FIFO control register</description><addressOffset>0x24</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S1CR</name><description>stream x configuration register</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S1NDTR</name><description>stream x number of data register</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S1PAR</name><description>stream x peripheral address register</description><addressOffset>0x30</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S1M0AR</name><description>stream x memory 0 address register</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S1M1AR</name><description>stream x memory 1 address register</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S1FCR</name><description>stream x FIFO control register</description><addressOffset>0x3C</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S2CR</name><description>stream x configuration register</description><addressOffset>0x40</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S2NDTR</name><description>stream x number of data register</description><addressOffset>0x44</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S2PAR</name><description>stream x peripheral address register</description><addressOffset>0x48</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S2M0AR</name><description>stream x memory 0 address register</description><addressOffset>0x4C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S2M1AR</name><description>stream x memory 1 address register</description><addressOffset>0x50</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S2FCR</name><description>stream x FIFO control register</description><addressOffset>0x54</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S3CR</name><description>stream x configuration register</description><addressOffset>0x58</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S3NDTR</name><description>stream x number of data register</description><addressOffset>0x5C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S3PAR</name><description>stream x peripheral address register</description><addressOffset>0x60</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S3M0AR</name><descript