Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
ion>stream x memory 0 address register</description><addressOffset>0x64</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S3M1AR</name><description>stream x memory 1 address register</description><addressOffset>0x68</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S3FCR</name><description>stream x FIFO control register</description><addressOffset>0x6C</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S4CR</name><description>stream x configuration register</description><addressOffset>0x70</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S4NDTR</name><description>stream x number of data register</description><addressOffset>0x74</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S4PAR</name><description>stream x peripheral address register</description><addressOffset>0x78</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S4M0AR</name><description>stream x memory 0 address register</description><addressOffset>0x7C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S4M1AR</name><description>stream x memory 1 address register</description><addressOffset>0x80</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S4FCR</name><description>stream x FIFO control register</description><addressOffset>0x84</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S5CR</name><description>stream x configuration register</description><addressOffset>0x88</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S5NDTR</name><description>stream x number of data register</description><addressOffset>0x8C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S5PAR</name><description>stream x peripheral address register</description><addressOffset>0x90</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S5M0AR</name><description>stream x memory 0 address register</description><addressOffset>0x94</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S5M1AR</name><description>stream x memory 1 address register</description><addressOffset>0x98</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S5FCR</name><description>stream x FIFO control register</description><addressOffset>0x9C</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S6CR</name><description>stream x configuration register</description><addressOffset>0xA0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S6NDTR</name><description>stream x number of data register</description><addressOffset>0xA4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S6PAR</name><description>stream x peripheral address register</description><addressOffset>0xA8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S6M0AR</name><description>stream x memory 0 address register</description><addressOffset>0xAC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S6M1AR</name><description>stream x memory 1 address register</description><addressOffset>0xB0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S6FCR</name><description>stream x FIFO control register</description><addressOffset>0xB4</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>S7CR</name><description>stream x configuration register</description><addressOffset>0xB8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHSEL</name><description>Channel selection</description><bitOffset>25</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MBURST</name><description>Memory burst transfer configuration</description><bitOffset>23</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PBURST</name><description>Peripheral burst transfer configuration</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CT</name><description>Current target (only in double buffer mode)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBM</name><description>Double buffer mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PL</name><description>Priority level</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PINCOS</name><description>Peripheral increment offset size</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIZE</name><description>Memory data size</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Peripheral data size</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PFCTRL</name><description>Peripheral flow controller</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer complete interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HTIE</name><description>Half transfer interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEIE</name><description>Transfer error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMEIE</name><description>Direct mode error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN</name><description>Stream enable / flag stream ready when read low</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>S7NDTR</name><description>stream x number of data register</description><addressOffset>0xBC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NDT</name><description>Number of data items to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>S7PAR</name><description>stream x peripheral address register</description><addressOffset>0xC0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S7M0AR</name><description>stream x memory 0 address register</description><addressOffset>0xC4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M0A</name><description>Memory 0 address</description><bitOffset>0</bitOffset><bitWidt