Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
h>32</bitWidth><access>read-write</access></field></fields></register><register><name>S7M1AR</name><description>stream x memory 1 address register</description><addressOffset>0xC8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>M1A</name><description>Memory 1 address (used in case of Double buffer mode)</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>S7FCR</name><description>stream x FIFO control register</description><addressOffset>0xCC</addressOffset><size>32</size><resetValue>0x21</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FEIE</name><description>FIFO error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FS</name><description>FIFO status</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field><field><name>DMDIS</name><description>Direct mode disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FTH</name><description>FIFO threshold selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral derivedFrom="DMA2"><name>DMA1</name><baseAddress>0x40026000</baseAddress><groupName>DMA1</groupName><interrupt><name>DMA1_Stream0</name><value>11</value></interrupt><interrupt><name>DMA1_Stream1</name><value>12</value></interrupt><interrupt><name>DMA1_Stream2</name><value>13</value></interrupt><interrupt><name>DMA1_Stream3</name><value>14</value></interrupt><interrupt><name>DMA1_Stream4</name><value>15</value></interrupt><interrupt><name>DMA1_Stream5</name><value>16</value></interrupt><interrupt><name>DMA1_Stream6</name><value>17</value></interrupt><interrupt><name>DMA1_Stream7</name><value>47</value></interrupt></peripheral><peripheral><name>RCC</name><description>Reset and clock control</description><baseAddress>0x40023800</baseAddress><groupName>RCC</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RCC</name><value>5</value></interrupt><registers><register><name>CR</name><description>clock control register</description><addressOffset>0x0</addressOffset><size>32</size><resetValue>0x83</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PLLI2SRDY</name><description>PLLI2S clock ready flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLI2SON</name><description>PLLI2S enable</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDY</name><description>Main PLL (PLL) clock ready flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLON</name><description>Main PLL (PLL) enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSON</name><description>Clock security system enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSEBYP</name><description>HSE clock bypass</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDY</name><description>HSE clock ready flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSEON</name><description>HSE clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSICAL</name><description>Internal high-speed clock calibration</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>HSITRIM</name><description>Internal high-speed clock trimming</description><bitOffset>3</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>HSIRDY</name><description>Internal high-speed clock ready flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSION</name><description>Internal high-speed clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>PLLCFGR</name><description>PLL configuration register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x24003010</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PLLQ3</name><description>Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLQ2</name><description>Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLQ1</name><description>Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLQ0</name><description>Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLSRC</name><description>Main PLL(PLL) and audio PLL (PLLI2S) entry clock source</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLP1</name><description>Main PLL (PLL) division factor for main system clock</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLP0</name><description>Main PLL (PLL) division factor for main system clock</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN8</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN7</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN6</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN5</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN4</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN3</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN2</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN1</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLN0</name><description>Main PLL (PLL) multiplication factor for VCO</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLM5</name><description>Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLM4</name><description>Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLM3</name><description>Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLM2</name><description>Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLM1</name><description>Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLM0</name><description>Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CFGR</name><description>clock configuration register</description><addressOffset>0x8</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MCO2</name><description>Microcontroller clock output 2</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCO2PRE</name><description>MCO2 prescaler</description><bitOffset>27</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MCO1PRE</name><description>MCO1 prescaler</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>I2SSRC</name><description>I2S clock selection</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MCO1</name><description>Microcontroller clock output 1</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>RTCPRE</name><description>HSE division factor for RTC clock</description><bitOffset>16</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>PPRE2</name><description>APB high-speed prescaler (APB2)</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PPRE1</name><description>APB Low speed prescaler (APB1)</description><bitOffset>10</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>HPRE</name><description>AHB prescaler</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>SWS1</name><description>System clock switch status</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SWS0</name><description>System clock switch status</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SW1</name><description>System clock switch</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SW0</name><description>System clock switch</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CIR</name><description>clock interrupt register</description><addressOffset>0xC</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CSSC</name><description>Clock security system interrupt clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLI2SRDYC</name><description>PLLI2S ready interrupt clear</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLRDYC</name><description>Main PLL(PLL) ready interrupt clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSERDYC</name><description>HSE ready interrupt clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSIRDYC</name><description>HSI ready interrupt clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSERDYC</name><description>LSE ready interrupt clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSIRDYC</name><description>LSI ready interrupt clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLI2SRDYIE</name><description>PLLI2S ready interrupt enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDYIE</name><description>Main PLL (PLL) ready interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDYIE</name><description>HSE ready interrupt enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDYIE</name><description>HSI ready interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDYIE</name><description>LSE ready interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDYIE</name><description>LSI ready interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSF</name><description>Clock security system interrupt flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLI2SRDYF</name><description>PLLI2S ready interrupt flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLRDYF</name><description>Main PLL (PLL) ready interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSERDYF</name><description>HSE ready interrupt flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSIRDYF</name><description>HSI ready interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSERDYF</name><description>LSE ready interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSIRDYF</name><description>LSI ready interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>AHB1RSTR</name><description>AHB1 peripheral reset register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OTGHSRST</name><description>USB OTG HS module reset</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACRST</name><description>Ethernet MAC reset</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMA2RST</name><description>DMA2 reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMA1RST</name><description>DMA2 reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CRCRST</name><description>CRC reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOIRST</name><description>IO port I reset</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOHRST</name><description>IO port H reset</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOGRST</name><description>IO port G reset</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOFRST</name><description>IO port F reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOERST</name><description>IO port E reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIODRST</name><description>IO port D reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOCRST</name><description>IO port C reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOBRST</name><description>IO port B reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOARST</name><description>IO port A reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB2RSTR</name><description>AHB2 peripheral reset register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OTGFSRST</name><description>USB OTG FS module reset</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RNGRST</name><description>Random number generator module reset</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCMIRST</name><description>Camera interface reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB3RSTR</name><description>AHB3 peripheral reset register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FSMCRST</name><description>Flexible static memory controller module reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>APB1RSTR</name><description>APB1 peripheral reset register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACRST</name><description>DAC reset</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PWRRST</name><description>Power interface reset</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN2RST</name><description>CAN2 reset</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN1RST</name><description>CAN1 reset</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C3RST</name><description>I2C3 reset</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C2RST</name><description>I2C 2 reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C1RST</name><description>I2C 1 reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART5RST</name><description>USART 5 reset</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART4RST</name><description>USART 4 reset</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART3RST</name><description>USART 3 reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART2RST</name><description>USART 2 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI3RST</name><description>SPI 3 reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI2RST</name><description>SPI 2 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGRST</name><description>Window watchdog reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM14RST</name><description>TIM14 reset</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM13RST</name><description>TIM13 reset</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM12RST</name><description>TIM12 reset</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM7RST</name><description>TIM7 reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM6RST</name><description>TIM6 reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM5RST</name><description>TIM5 reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM4RST</name><description>TIM4 reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM3RST</name><description>TIM3 reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM2RST</name><description>TIM2 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>APB2RSTR</name><description>APB2 peripheral reset register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TIM11RST</name><description>TIM11 reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM10RST</name><description>TIM10 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM9RST</name><description>TIM9 reset</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SYSCFGRST</name><description>System configuration controller reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI1RST</name><description>SPI 1 reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIORST</name><description>SDIO reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADCRST</name><description>ADC interface reset (common to all ADCs)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART6RST</name><description>USART6 reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART1RST</name><description>USART1 reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM8RST</name><description>TIM8 reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM1RST</name><description>TIM1 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB1ENR</name><description>AHB1 peripheral clock register</description><addressOffset>0x30</addressOffset><size>32</size><access>read-write</access>