Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
<resetValue>0x100000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OTGHSULPIEN</name><description>USB OTG HSULPI clock enable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGHSEN</name><description>USB OTG HS clock enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACPTPEN</name><description>Ethernet PTP clock enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACRXEN</name><description>Ethernet Reception clock enable</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACTXEN</name><description>Ethernet Transmission clock enable</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACEN</name><description>Ethernet MAC clock enable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMA2EN</name><description>DMA2 clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMA1EN</name><description>DMA1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCMDATARAMEN</name><description>CCM data RAM clock enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BKPSRAMEN</name><description>Backup SRAM interface clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CRCEN</name><description>CRC clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOIEN</name><description>IO port I clock enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOHEN</name><description>IO port H clock enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOGEN</name><description>IO port G clock enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOFEN</name><description>IO port F clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOEEN</name><description>IO port E clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIODEN</name><description>IO port D clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOCEN</name><description>IO port C clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOBEN</name><description>IO port B clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOAEN</name><description>IO port A clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB2ENR</name><description>AHB2 peripheral clock enable register</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OTGFSEN</name><description>USB OTG FS clock enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RNGEN</name><description>Random number generator clock enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCMIEN</name><description>Camera interface enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB3ENR</name><description>AHB3 peripheral clock enable register</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FSMCEN</name><description>Flexible static memory controller module clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>APB1ENR</name><description>APB1 peripheral clock enable register</description><addressOffset>0x40</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACEN</name><description>DAC interface clock enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PWREN</name><description>Power interface clock enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN2EN</name><description>CAN 2 clock enable</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN1EN</name><description>CAN 1 clock enable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C3EN</name><description>I2C3 clock enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C2EN</name><description>I2C2 clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C1EN</name><description>I2C1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART5EN</name><description>UART5 clock enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART4EN</name><description>UART4 clock enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART3EN</name><description>USART3 clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART2EN</name><description>USART 2 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI3EN</name><description>SPI3 clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI2EN</name><description>SPI2 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGEN</name><description>Window watchdog clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM14EN</name><description>TIM14 clock enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM13EN</name><description>TIM13 clock enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM12EN</name><description>TIM12 clock enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM7EN</name><description>TIM7 clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM6EN</name><description>TIM6 clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM5EN</name><description>TIM5 clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM4EN</name><description>TIM4 clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM3EN</name><description>TIM3 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM2EN</name><description>TIM2 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>APB2ENR</name><description>APB2 peripheral clock enable register</description><addressOffset>0x44</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TIM11EN</name><description>TIM11 clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM10EN</name><description>TIM10 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM9EN</name><description>TIM9 clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SYSCFGEN</name><description>System configuration controller clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI1EN</name><description>SPI1 clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIOEN</name><description>SDIO clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC3EN</name><description>ADC3 clock enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC2EN</name><description>ADC2 clock enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC1EN</name><description>ADC1 clock enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART6EN</name><description>USART6 clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART1EN</name><description>USART1 clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM8EN</name><description>TIM8 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM1EN</name><description>TIM1 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB1LPENR</name><description>AHB1 peripheral clock enable in low power mode register</description><addressOffset>0x50</addressOffset><size>32</size><access>read-write</access><resetValue>0x7E6791FF</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OTGHSULPILPEN</name><description>USB OTG HS ULPI clock enable during Sleep mode</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGHSLPEN</name><description>USB OTG HS clock enable during Sleep mode</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACPTPLPEN</name><description>Ethernet PTP clock enable during Sleep mode</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACRXLPEN</name><description>Ethernet reception clock enable during Sleep mode</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACTXLPEN</name><description>Ethernet transmission clock enable during Sleep mode</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHMACLPEN</name><description>Ethernet MAC clock enable during Sleep mode</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMA2LPEN</name><description>DMA2 clock enable during Sleep mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMA1LPEN</name><description>DMA1 clock enable during Sleep mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BKPSRAMLPEN</name><description>Backup SRAM interface clock enable during Sleep mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRAM2LPEN</name><description>SRAM 2 interface clock enable during Sleep mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRAM1LPEN</name><description>SRAM 1interface clock enable during Sleep mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FLITFLPEN</name><description>Flash interface clock enable during Sleep mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CRCLPEN</name><description>CRC clock enable during Sleep mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOILPEN</name><description>IO port I clock enable during Sleep mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOHLPEN</name><description>IO port H clock enable during Sleep mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOGLPEN</name><description>IO port G clock enable during Sleep mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOFLPEN</name><description>IO port F clock enable during Sleep mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOELPEN</name><description>IO port E clock enable during Sleep mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIODLPEN</name><description>IO port D clock enable during Sleep mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOCLPEN</name><description>IO port C clock enable during Sleep mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOBLPEN</name><description>IO port B clock enable during Sleep mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GPIOALPEN</name><description>IO port A clock enable during sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB2LPENR</name><description>AHB2 peripheral clock enable in low power mode register</description><addressOffset>0x54</addressOffset><size>32</size><access>read-write</access><resetValue>0xF1</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OTGFSLPEN</name><description>USB OTG FS clock enable during Sleep mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RNGLPEN</name><description>Random number generator clock enable during Sleep mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCMILPEN</name><description>Camera interface enable during Sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHB3LPENR</name><description>AHB3 peripheral clock enable in low power mode register</description><addressOffset>0x58</addressOffset><size>32</size><access>read-write</access><resetValue>0x1</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FSMCLPEN</name><description>Flexible static memory controller module clock enable during Sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>APB1LPENR</name><description>APB1 peripheral clock enable in low power mode register</description><addressOffset>0x60</addressOffset><size>32</size><access>read-write</access><resetValue>0x36FEC9FF</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACLPEN</name><description>DAC interface clock enable during Sleep mode</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PWRLPEN</name><description>Power interface clock enable during Sleep mode</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN2LPEN</name><description>CAN 2 clock enable during Sleep mode</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN1LPEN</name><description>CAN 1 clock enable during Sleep mode</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C3LPEN</name><description>I2C3 clock enable during Sleep mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C2LPEN</name><description>I2C2 clock enable during Sleep mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C1LPEN</name><description>I2C1 clock enable during Sleep mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART5LPEN</name><description>UART5 clock enable during Sleep mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UART4LPEN</name><description>UART4 clock enable during Sleep mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART3LPEN</name><description>USART3 clock enable during Sleep mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART2LPEN</name><description>USART2 clock enable during Sleep mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI3LPEN</name><description>SPI3 clock enable during Sleep mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI2LPEN</name><description>SPI2 clock enable during Sleep mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGLPEN</name><description>Window watchdog clock enable during Sleep mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM14LPEN</name><description>TIM14 clock enable during Sleep mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM13LPEN</name><description>TIM13 clock enable during Sleep mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM12LPEN</name><description>TIM12 clock enable during Sleep mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM7LPEN</name><description>TIM7 clock enable during Sleep mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM6LPEN</name><description>TIM6 clock enable during Sleep mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM5LPEN</name><description>TIM5 clock enable during Sleep mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM4LPEN</name><description>TIM4 clock enable during Sleep mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM3LPEN</name><description>TIM3 clock enable during Sleep mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM2LPEN</name><description>TIM2 clock enable during Sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>APB2LPENR</name><description>APB2 peripheral clock enabled in low power mode register</description><addressOffset>0x64</addressOffset><size>32</size><access>read-write</access><resetValue>0x75F33</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TIM11LPEN</name><description>TIM11 clock enable during Sleep mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM10LPEN</name><description>TIM10 clock enable during Sleep mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM9LPEN</name><description>TIM9 clock enable during sleep mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SYSCFGLPEN</name><description>System configuration controller clock enable during Sleep mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPI1LPEN</name><description>SPI 1 clock enable during Sleep mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIOLPEN</name><description>SDIO clock enable during Sleep mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC3LPEN</name><description>ADC 3 clock enable during Sleep mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC2LPEN</name><description>ADC2 clock enable during Sleep mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC1LPEN</name><description>ADC1 clock enable during Sleep mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART6LPEN</name><description>USART6 clock enable during Sleep mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART1LPEN</name><description>USART1 clock enable during Sleep mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM8LPEN</name><description>TIM8 clock enable during Sleep mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM1LPEN</name><description>TIM1 clock enable during Sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>BDCR</name><description>Backup domain control register</description><addressOffset>0x70</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>BDRST</name><description>Backup domain software reset</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCEN</name><description>RTC clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCSEL1</name><description>RTC clock source selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCSEL0</name><description>RTC clock source selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSEBYP</name><description>External low-speed oscillator bypass</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDY</name><des