Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
cription>External low-speed oscillator ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSEON</name><description>External low-speed oscillator enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CSR</name><description>clock control &amp; status register</description><addressOffset>0x74</addressOffset><size>32</size><resetValue>0xE000000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>LPWRRSTF</name><description>Low-power reset flag</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGRSTF</name><description>Window watchdog reset flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDGRSTF</name><description>Independent watchdog reset flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SFTRSTF</name><description>Software reset flag</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PORRSTF</name><description>POR/PDR reset flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PADRSTF</name><description>PIN reset flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BORRSTF</name><description>BOR reset flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RMVF</name><description>Remove reset flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDY</name><description>Internal low-speed oscillator ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSION</name><description>Internal low-speed oscillator enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>SSCGR</name><description>spread spectrum clock generation register</description><addressOffset>0x80</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SSCGEN</name><description>Spread spectrum modulation enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPREADSEL</name><description>Spread Select</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INCSTEP</name><description>Incrementation step</description><bitOffset>13</bitOffset><bitWidth>15</bitWidth><access>read-write</access></field><field><name>MODPER</name><description>Modulation period</description><bitOffset>0</bitOffset><bitWidth>13</bitWidth><access>read-write</access></field></fields></register><register><name>PLLI2SCFGR</name><description>PLLI2S configuration register</description><addressOffset>0x84</addressOffset><size>32</size><access>read-write</access><resetValue>0x20003000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PLLI2SRx</name><description>PLLI2S division factor for I2S clocks</description><bitOffset>28</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PLLI2SNx</name><description>PLLI2S multiplication factor for VCO</description><bitOffset>6</bitOffset><bitWidth>9</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>GPIOI</name><description>General-purpose I/Os</description><baseAddress>0x40022000</baseAddress><groupName>GPIO</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>MODER</name><description>GPIO port mode register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MODER15</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER14</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER13</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER12</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER11</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER10</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER9</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER8</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER7</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER6</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER5</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER4</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER3</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER2</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER1</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MODER0</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTYPER</name><description>GPIO port output type register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OT15</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT14</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT13</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT12</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT11</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT10</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT9</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT8</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT7</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT6</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT5</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT4</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT3</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT2</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT1</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OT0</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OSPEEDR</name><description>GPIO port output speed register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OSPEEDR15</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR14</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR13</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR12</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR11</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR10</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR9</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR8</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR7</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR6</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR5</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR4</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR3</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR2</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR1</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR0</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>PUPDR</name><description>GPIO port pull-up/pull-down register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PUPDR15</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR14</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR13</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR12</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR11</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR10</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR9</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR8</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR7</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR6</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR5</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR4</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR3</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR2</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR1</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR0</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>IDR</name><description>GPIO port input data register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>IDR15</name><description>Port input data (y = 0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR14</name><description>Port input data (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR13</name><description>Port input data (y = 0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR12</name><description>Port input data (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR11</name><description>Port input data (y = 0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR10</name><description>Port input data (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR9</name><description>Port input data (y = 0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR8</name><description>Port input data (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR7</name><description>Port input data (y = 0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR6</name><description>Port input data (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR5</name><description>Port input data (y = 0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR4</name><description>Port input data (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR3</name><description>Port input data (y = 0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR2</name><description>Port input data (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR1</name><description>Port input data (y = 0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR0</name><description>Port input data (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>ODR</name><description>GPIO port output data register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>ODR15</name><description>Port output data (y = 0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR14</name><description>Port output data (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR13</name><description>Port output data (y = 0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR12</name><description>Port output data (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR11</name><description>Port output data (y = 0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR10</name><description>Port output data (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR9</name><description>Port output data (y = 0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR8</name><description>Port output data (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR7</name><description>Port output data (y = 0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR6</name><description>Port output data (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR5</name><description>Port output data (y = 0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR4</name><description>Port output data (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR3</name><description>Port output data (y = 0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR2</name><description>Port output data (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR1</name><description>Port output data (y = 0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR0</name><description>Port output data (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>BSRR</name><description>GPIO port bit set/reset register</description><addressOffset>0x18</addressOffset><size>32</size><access>write-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>BR15</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR14</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR13</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR12</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR11</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR10</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR9</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR8</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR7</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR6</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR5</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR4</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR3</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR2</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only<