Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR6</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR5</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR4</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR3</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR2</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR1</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>OSPEEDR0</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>PUPDR</name><description>GPIO port pull-up/pull-down register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x64000000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PUPDR15</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR14</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR13</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR12</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR11</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR10</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR9</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR8</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR7</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR6</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR5</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR4</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR3</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR2</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR1</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PUPDR0</name><description>Port x configuration bits (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>IDR</name><description>GPIO port input data register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>IDR15</name><description>Port input data (y = 0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR14</name><description>Port input data (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR13</name><description>Port input data (y = 0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR12</name><description>Port input data (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR11</name><description>Port input data (y = 0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR10</name><description>Port input data (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR9</name><description>Port input data (y = 0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR8</name><description>Port input data (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR7</name><description>Port input data (y = 0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR6</name><description>Port input data (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR5</name><description>Port input data (y = 0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR4</name><description>Port input data (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR3</name><description>Port input data (y = 0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR2</name><description>Port input data (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR1</name><description>Port input data (y = 0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDR0</name><description>Port input data (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>ODR</name><description>GPIO port output data register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>ODR15</name><description>Port output data (y = 0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR14</name><description>Port output data (y = 0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR13</name><description>Port output data (y = 0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR12</name><description>Port output data (y = 0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR11</name><description>Port output data (y = 0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR10</name><description>Port output data (y = 0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR9</name><description>Port output data (y = 0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR8</name><description>Port output data (y = 0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR7</name><description>Port output data (y = 0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR6</name><description>Port output data (y = 0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR5</name><description>Port output data (y = 0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR4</name><description>Port output data (y = 0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR3</name><description>Port output data (y = 0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR2</name><description>Port output data (y = 0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR1</name><description>Port output data (y = 0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODR0</name><description>Port output data (y = 0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>BSRR</name><description>GPIO port bit set/reset register</description><addressOffset>0x18</addressOffset><size>32</size><access>write-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>BR15</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR14</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR13</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR12</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR11</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR10</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR9</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR8</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR7</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR6</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR5</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR4</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR3</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR2</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR1</name><description>Port x reset bit y (y = 0..15)</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BR0</name><description>Port x set bit y (y= 0..15)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS15</name><description>Port x set bit y (y= 0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS14</name><description>Port x set bit y (y= 0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS13</name><description>Port x set bit y (y= 0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS12</name><description>Port x set bit y (y= 0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS11</name><description>Port x set bit y (y= 0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS10</name><description>Port x set bit y (y= 0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS9</name><description>Port x set bit y (y= 0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS8</name><description>Port x set bit y (y= 0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS7</name><description>Port x set bit y (y= 0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS6</name><description>Port x set bit y (y= 0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS5</name><description>Port x set bit y (y= 0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS4</name><description>Port x set bit y (y= 0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS3</name><description>Port x set bit y (y= 0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS2</name><description>Port x set bit y (y= 0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS1</name><description>Port x set bit y (y= 0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BS0</name><description>Port x set bit y (y= 0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field></fields></register><register><name>LCKR</name><description>GPIO port configuration lock register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>LCKK</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK15</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK14</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK13</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK12</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK11</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK10</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK9</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK8</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK7</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK6</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK5</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK4</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK3</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK2</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK1</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LCK0</name><description>Port x lock bit y (y= 0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AFRL</name><description>GPIO alternate function low register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>AFRL7</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRL6</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRL5</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRL4</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRL3</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRL2</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRL1</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRL0</name><description>Alternate function selection for port x bit y (y = 0..7)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>AFRH</name><description>GPIO alternate function high register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>AFRH15</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRH14</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRH13</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRH12</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRH11</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRH10</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRH9</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>AFRH8</name><description>Alternate function selection for port x bit y (y = 8..15)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>SYSCFG</name><description>System configuration controller</description><baseAddress>0x40013800</baseAddress><groupName>SYSCFG</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>MEMRM</name><description>memory remap register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MEM_MODE</name><description>MEM_MODE</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>PMC</name><description>peripheral mode configuration register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MII_RMII_SEL</name><description>Ethernet PHY interface selection</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>EXTICR1</name><description>external interrupt configuration register 1</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EXTI3</name><description>EXTI x configuration (x = 0 to 3)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI2</name><description>EXTI x configuration (x = 0 to 3)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI1</name><description>EXTI x configuration (x = 0 to 3)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI0</name><description>EXTI x configuration (x = 0 to 3)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>EXTICR2</name><description>external interrupt configuration register 2</description><addressOffset>0xC</add