Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
ressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EXTI7</name><description>EXTI x configuration (x = 4 to 7)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI6</name><description>EXTI x configuration (x = 4 to 7)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI5</name><description>EXTI x configuration (x = 4 to 7)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI4</name><description>EXTI x configuration (x = 4 to 7)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>EXTICR3</name><description>external interrupt configuration register 3</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EXTI11</name><description>EXTI x configuration (x = 8 to 11)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI10</name><description>EXTI10</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI9</name><description>EXTI x configuration (x = 8 to 11)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI8</name><description>EXTI x configuration (x = 8 to 11)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>EXTICR4</name><description>external interrupt configuration register 4</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EXTI15</name><description>EXTI x configuration (x = 12 to 15)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI14</name><description>EXTI x configuration (x = 12 to 15)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI13</name><description>EXTI x configuration (x = 12 to 15)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EXTI12</name><description>EXTI x configuration (x = 12 to 15)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>CMPCR</name><description>Compensation cell control register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>READY</name><description>READY</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CMP_PD</name><description>Compensation cell power-down</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral><name>SPI1</name><description>Serial peripheral interface</description><baseAddress>0x40013000</baseAddress><groupName>SPI</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>SPI1</name><value>35</value></interrupt><registers><register><name>CR1</name><description>control register 1</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>BIDIMODE</name><description>Bidirectional data mode enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BIDIOE</name><description>Output enable in bidirectional mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CRCEN</name><description>Hardware CRC calculation enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CRCNEXT</name><description>CRC transfer next</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DFF</name><description>Data frame format</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXONLY</name><description>Receive only</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SSM</name><description>Software slave management</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SSI</name><description>Internal slave select</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSBFIRST</name><description>Frame format</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPE</name><description>SPI enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BR</name><description>Baud rate control</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MSTR</name><description>Master selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CR2</name><description>control register 2</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TXEIE</name><description>Tx buffer empty interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXNEIE</name><description>RX buffer not empty interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRF</name><description>Frame format</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SSOE</name><description>SS output enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXDMAEN</name><description>Tx buffer DMA enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXDMAEN</name><description>Rx buffer DMA enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>SR</name><description>status register</description><addressOffset>0x8</addressOffset><size>32</size><resetValue>0x2</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TIFRFE</name><description>TI frame format error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BSY</name><description>Busy flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OVR</name><description>Overrun flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MODF</name><description>Mode fault</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CRCERR</name><description>CRC error flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UDR</name><description>Underrun flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CHSIDE</name><description>Channel side</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXE</name><description>Transmit buffer empty</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXNE</name><description>Receive buffer not empty</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DR</name><description>data register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DR</name><description>Data register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>CRCPR</name><description>CRC polynomial register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x7</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CRCPOLY</name><description>CRC polynomial register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>RXCRCR</name><description>RX CRC register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RxCRC</name><description>Rx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>TXCRCR</name><description>TX CRC register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TxCRC</name><description>Tx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>I2SCFGR</name><description>I2S configuration register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>I2SMOD</name><description>I2S mode selection</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2SE</name><description>I2S Enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2SCFG</name><description>I2S configuration mode</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PCMSYNC</name><description>PCM frame synchronization</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2SSTD</name><description>I2S standard selection</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CKPOL</name><description>Steady state clock polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DATLEN</name><description>Data length to be transferred</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CHLEN</name><description>Channel length (number of bits per audio channel)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>I2SPR</name><description>I2S prescaler register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x10</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MCKOE</name><description>Master clock output enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ODD</name><description>Odd factor for the prescaler</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2SDIV</name><description>I2S Linear prescaler</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral derivedFrom="SPI1"><name>SPI2</name><baseAddress>0x40003800</baseAddress><groupName>SPI2</groupName><interrupt><name>SPI2</name><value>36</value></interrupt></peripheral><peripheral derivedFrom="SPI1"><name>SPI3</name><baseAddress>0x40003C00</baseAddress><groupName>SPI3</groupName><interrupt><name>SPI3</name><value>51</value></interrupt></peripheral><peripheral derivedFrom="SPI1"><name>I2S2ext</name><baseAddress>0x40003400</baseAddress><groupName>I2S2ext</groupName></peripheral><peripheral derivedFrom="SPI1"><name>I2S3ext</name><baseAddress>0x40004000</baseAddress><groupName>I2S3ext</groupName></peripheral><peripheral><name>SDIO</name><description>Secure digital input/output interface</description><baseAddress>0x40012C00</baseAddress><groupName>SDIO</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>SDIO</name><value>49</value></interrupt><registers><register><name>POWER</name><description>power control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PWRCTRL</name><description>PWRCTRL</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>CLKCR</name><description>SDI clock control register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>HWFC_EN</name><description>HW Flow Control enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NEGEDGE</name><description>SDIO_CK dephasing selection bit</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WIDBUS</name><description>Wide bus mode enable bit</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>BYPASS</name><description>Clock divider bypass enable bit</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PWRSAV</name><description>Power saving configuration bit</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CLKEN</name><description>Clock enable bit</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CLKDIV</name><description>Clock divide factor</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register><register><name>ARG</name><description>argument register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CMDARG</name><description>Command argument</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>CMD</name><description>command register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CE_ATACMD</name><description>CE-ATA command</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>nIEN</name><description>not Interrupt Enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENCMDcompl</name><description>Enable CMD completion</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIOSuspend</name><description>SD I/O suspend command</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CPSMEN</name><description>Command path state machine (CPSM) Enable bit</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WAITPEND</name><description>CPSM Waits for ends of data transfer (CmdPend internal signal).</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WAITINT</name><description>CPSM waits for interrupt request</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WAITRESP</name><description>Wait for response bits</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CMDINDEX</name><description>Command index</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth><access>read-write</access></field></fields></register><register><name>RESPCMD</name><description>command response register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RESPCMD</name><description>Response command index</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth><access>read-only</access></field></fields></register><register><name>RESP1</name><description>response 1..4 register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CARDSTATUS1</name><description>see Table 132.</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field></fields></register><register><name>RESP2</name><description>response 1..4 register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CARDSTATUS2</name><description>see Table 132.</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field></fields></register><register><name>RESP3</name><description>response 1..4 register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CARDSTATUS3</name><description>see Table 132.</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field></fields></register><register><name>RESP4</name><description>response 1..4 register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CARDSTATUS4</name><description>see Table 132.</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field></fields></register><register><name>DTIMER</name><description>data timer register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DATATIME</name><description>Data timeout period</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>DLEN</name><description>data length register</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DATALENGTH</name><description>Data length value</description><bitOffset>0</bitOffset><bitWidth>25</bitWidth><access>read-write</access></field></fields></register><register><name>DCTRL</name><description>data control register</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SDIOEN</name><description>SD I/O enable functions</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RWMOD</name><description>Read wait mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RWSTOP</name><description>Read wait stop</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RWSTART</name><description>Read wait start</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBLOCKSIZE</name><description>Data block size</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>DMAEN</name><description>DMA enable bit</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTMODE</name><description>Data transfer mode selection 1: Stream or SDIO multibyte data transfer.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTDIR</name><description>Data transfer direction selection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTEN</name><description>DTEN</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DCOUNT</name><description>data counter register</description><addressOffset>0x30</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DATACOUNT</name><description>Data count value</description><bitOffset>0</bitOffset><bitWidth>25</bitWidth><access>read-only</access></field></fields></register><register><name>STA</name><description>status register</description><addressOffset>0x34</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CEATAEND</name><description>CE-ATA command completion signal received for CMD61</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SDIOIT</name><description>SDIO interrupt received</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXDAVL</name><description>Data available in receive FIFO</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXDAVL</name><description>Data available in transmit FIFO</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXFIFOE</name><description>Receive FIFO empty</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOE</name><description>Transmit FIFO empty</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXFIFOF</name><description>Receive FIFO full</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOF</name><description>Transmit FIFO full</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXFIFOHF</name><description>Receive FIFO half full: there are at least 8 words in the FIFO</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOHE</name><description>Transmit FIFO half empty: at least 8 words can be written into the FIFO</description>