Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
<bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXACT</name><description>Data receive in progress</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXACT</name><description>Data transmit in progress</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CMDACT</name><description>Command transfer in progress</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DBCKEND</name><description>Data block sent/received (CRC check passed)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STBITERR</name><description>Start bit not detected on all data signals in wide bus mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DATAEND</name><description>Data end (data counter, SDIDCOUNT, is zero)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CMDSENT</name><description>Command sent (no response required)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CMDREND</name><description>Command response received (CRC check passed)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXOVERR</name><description>Received FIFO overrun error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXUNDERR</name><description>Transmit FIFO underrun error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DTIMEOUT</name><description>Data timeout</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CTIMEOUT</name><description>Command response timeout</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DCRCFAIL</name><description>Data block sent/received (CRC check failed)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CCRCFAIL</name><description>Command response received (CRC check failed)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>ICR</name><description>interrupt clear register</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CEATAENDC</name><description>CEATAEND flag clear bit</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIOITC</name><description>SDIOIT flag clear bit</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBCKENDC</name><description>DBCKEND flag clear bit</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STBITERRC</name><description>STBITERR flag clear bit</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DATAENDC</name><description>DATAEND flag clear bit</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMDSENTC</name><description>CMDSENT flag clear bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMDRENDC</name><description>CMDREND flag clear bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXOVERRC</name><description>RXOVERR flag clear bit</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXUNDERRC</name><description>TXUNDERR flag clear bit</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTIMEOUTC</name><description>DTIMEOUT flag clear bit</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTIMEOUTC</name><description>CTIMEOUT flag clear bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCRCFAILC</name><description>DCRCFAIL flag clear bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCRCFAILC</name><description>CCRCFAIL flag clear bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>MASK</name><description>mask register</description><addressOffset>0x3C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CEATAENDIE</name><description>CE-ATA command completion signal received interrupt enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIOITIE</name><description>SDIO mode interrupt received interrupt enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXDAVLIE</name><description>Data available in Rx FIFO interrupt enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXDAVLIE</name><description>Data available in Tx FIFO interrupt enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFIFOEIE</name><description>Rx FIFO empty interrupt enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFIFOEIE</name><description>Tx FIFO empty interrupt enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFIFOFIE</name><description>Rx FIFO full interrupt enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFIFOFIE</name><description>Tx FIFO full interrupt enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFIFOHFIE</name><description>Rx FIFO half full interrupt enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFIFOHEIE</name><description>Tx FIFO half empty interrupt enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXACTIE</name><description>Data receive acting interrupt enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXACTIE</name><description>Data transmit acting interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMDACTIE</name><description>Command acting interrupt enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBCKENDIE</name><description>Data block end interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STBITERRIE</name><description>Start bit error interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DATAENDIE</name><description>Data end interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMDSENTIE</name><description>Command sent interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMDRENDIE</name><description>Command response received interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXOVERRIE</name><description>Rx FIFO overrun error interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXUNDERRIE</name><description>Tx FIFO underrun error interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTIMEOUTIE</name><description>Data timeout interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTIMEOUTIE</name><description>Command timeout interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCRCFAILIE</name><description>Data CRC fail interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCRCFAILIE</name><description>Command CRC fail interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FIFOCNT</name><description>FIFO counter register</description><addressOffset>0x48</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FIFOCOUNT</name><description>Remaining number of words to be written to or read from the FIFO.</description><bitOffset>0</bitOffset><bitWidth>24</bitWidth><access>read-only</access></field></fields></register><register><name>FIFO</name><description>data FIFO register</description><addressOffset>0x80</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FIFOData</name><description>Receive and transmit FIFO data</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>ADC1</name><description>Analog-to-digital converter</description><baseAddress>0x40012000</baseAddress><groupName>ADC</groupName><addressBlock><offset>0x0</offset><size>0x51</size><usage>registers</usage></addressBlock><interrupt><name>ADC</name><value>18</value></interrupt><registers><register><name>SR</name><description>status register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OVR</name><description>Overrun</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STRT</name><description>Regular channel start flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>JSTRT</name><description>Injected channel start flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>JEOC</name><description>Injected channel end of conversion</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOC</name><description>Regular channel end of conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AWD</name><description>Analog watchdog flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CR1</name><description>control register 1</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OVRIE</name><description>Overrun interrupt enable</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RES</name><description>Resolution</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>AWDEN</name><description>Analog watchdog enable on regular channels</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>JAWDEN</name><description>Analog watchdog enable on injected channels</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCNUM</name><description>Discontinuous mode channel count</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>JDISCEN</name><description>Discontinuous mode on injected channels</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCEN</name><description>Discontinuous mode on regular channels</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>JAUTO</name><description>Automatic injected group conversion</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AWDSGL</name><description>Enable the watchdog on a single channel in scan mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCAN</name><description>Scan mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>JEOCIE</name><description>Interrupt enable for injected channels</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AWDIE</name><description>Analog watchdog interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOCIE</name><description>Interrupt enable for EOC</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AWDCH</name><description>Analog watchdog channel select bits</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field></fields></register><register><name>CR2</name><description>control register 2</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SWSTART</name><description>Start conversion of regular channels</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EXTEN</name><description>External trigger enable for regular channels</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>EXTSEL</name><description>External event select for regular group</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>JSWSTART</name><description>Start conversion of injected channels</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>JEXTEN</name><description>External trigger enable for injected channels</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>JEXTSEL</name><description>External event select for injected group</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>ALIGN</name><description>Data alignment</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOCS</name><description>End of conversion selection</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DDS</name><description>DMA disable selection (for single ADC mode)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMA</name><description>Direct memory access mode (for single ADC mode)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CONT</name><description>Continuous conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADON</name><description>A/D Converter ON / OFF</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>SMPR1</name><description>sample time register 1</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SMPx_x</name><description>Sample time bits</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>SMPR2</name><description>sample time register 2</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SMPx_x</name><description>Sample time bits</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>JOFR1</name><description>injected channel data offset register x</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JOFFSET1</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>JOFR2</name><description>injected channel data offset register x</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JOFFSET2</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>JOFR3</name><description>injected channel data offset register x</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JOFFSET3</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>JOFR4</name><description>injected channel data offset register x</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JOFFSET4</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>HTR</name><description>watchdog higher threshold register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0xFFF</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>HT</name><description>Analog watchdog higher threshold</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>LTR</name><description>watchdog lower threshold register</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>LT</name><description>Analog watchdog lower threshold</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>SQR1</name><description>regular sequence register 1</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>L</name><description>Regular channel sequence length</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>SQ16</name><description>16th conversion in regular sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ15</name><description>15th conversion in regular sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ14</name><description>14th conversion in regular sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ13</name><description>13th conversion in regular sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field></fields></register><register><name>SQR2</name><description>regular sequence register 2</description><addressOffset>0x30</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SQ12</name><description>12th conversion in regular sequence</description><bitOffset>25</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ11</name><description>11th conversion in regular sequence</description><bitOffset>20</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ10</name><description>10th conversion in regular sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ9</name><description>9th conversion in regular sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ8</name><description>8th conversion in regular sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ7</name><description>7th conversion in regular sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field></fields></register><register><name>SQR3</name><description>regular sequence register 3</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SQ6</name><description>6th conversion in regular sequence</description><bitOffset>25</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ5</name><description>5th conversion in regular sequence</description><bitOffset>20</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ4</name><description>4th conversion in regular sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ3</name><description>3rd conversion in regular sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ2</name><description>2nd conversion in regular sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>SQ1</name><description>1st conversion in regular sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field></fields></register><register><name>JSQR</name><description>injected sequence register</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JL</name><description>Injected sequence length</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>JSQ4</name><description>4th conversion in injected sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>JSQ3</name><description>3rd conversion in injected sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>JSQ2</name><description>2nd conversion in inje