Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
cted sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>JSQ1</name><description>1st conversion in injected sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field></fields></register><register><name>JDR1</name><description>injected data register x</description><addressOffset>0x3C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JDATA</name><description>Injected data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>JDR2</name><description>injected data register x</description><addressOffset>0x40</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JDATA</name><description>Injected data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>JDR3</name><description>injected data register x</description><addressOffset>0x44</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JDATA</name><description>Injected data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>JDR4</name><description>injected data register x</description><addressOffset>0x48</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>JDATA</name><description>Injected data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>DR</name><description>regular data register</description><addressOffset>0x4C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DATA</name><description>Regular data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral derivedFrom="ADC1"><name>ADC2</name><baseAddress>0x40012100</baseAddress><groupName>ADC2</groupName></peripheral><peripheral derivedFrom="ADC1"><name>ADC3</name><baseAddress>0x40012200</baseAddress><groupName>ADC3</groupName></peripheral><peripheral><name>USART6</name><description>Universal synchronous asynchronous receiver transmitter</description><baseAddress>0x40011400</baseAddress><groupName>USART</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>USART6</name><value>71</value></interrupt><registers><register><name>SR</name><description>Status register</description><addressOffset>0x0</addressOffset><size>32</size><resetValue>0xC00000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CTS</name><description>CTS flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LBD</name><description>LIN break detection flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXE</name><description>Transmit data register empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TC</name><description>Transmission complete</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXNE</name><description>Read data register not empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IDLE</name><description>IDLE line detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ORE</name><description>Overrun error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NF</name><description>Noise detected flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FE</name><description>Framing error</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PE</name><description>Parity error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DR</name><description>Data register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DR</name><description>Data value</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth><access>read-write</access></field></fields></register><register><name>BRR</name><description>Baud rate register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DIV_Mantissa</name><description>mantissa of USARTDIV</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field><field><name>DIV_Fraction</name><description>fraction of USARTDIV</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>CR1</name><description>Control register 1</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OVER8</name><description>Oversampling mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UE</name><description>USART enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>M</name><description>Word length</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WAKE</name><description>Wakeup method</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PCE</name><description>Parity control enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PS</name><description>Parity selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PEIE</name><description>PE interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXEIE</name><description>TXE interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transmission complete interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXNEIE</name><description>RXNE interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IDLEIE</name><description>IDLE interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TE</name><description>Transmitter enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RE</name><description>Receiver enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RWU</name><description>Receiver wakeup</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SBK</name><description>Send break</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CR2</name><description>Control register 2</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>LINEN</name><description>LIN mode enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STOP</name><description>STOP bits</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CLKEN</name><description>Clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LBCL</name><description>Last bit clock pulse</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LBDIE</name><description>LIN break detection interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LBDL</name><description>lin break detection length</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADD</name><description>Address of the USART node</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>CR3</name><description>Control register 3</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>ONEBIT</name><description>One sample bit method enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTSIE</name><description>CTS interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTSE</name><description>CTS enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTSE</name><description>RTS enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMAT</name><description>DMA enable transmitter</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMAR</name><description>DMA enable receiver</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCEN</name><description>Smartcard mode enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NACK</name><description>Smartcard NACK enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HDSEL</name><description>Half-duplex selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IRLP</name><description>IrDA low-power</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IREN</name><description>IrDA mode enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EIE</name><description>Error interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>GTPR</name><description>Guard time and prescaler register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>GT</name><description>Guard time value</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral derivedFrom="USART6"><name>USART1</name><baseAddress>0x40011000</baseAddress><groupName>USART1</groupName><interrupt><name>USART1</name><value>37</value></interrupt></peripheral><peripheral derivedFrom="USART6"><name>USART2</name><baseAddress>0x40004400</baseAddress><groupName>USART2</groupName><interrupt><name>USART2</name><value>38</value></interrupt></peripheral><peripheral derivedFrom="USART6"><name>USART3</name><baseAddress>0x40004800</baseAddress><groupName>USART3</groupName><interrupt><name>USART3</name><value>39</value></interrupt></peripheral><peripheral><name>DAC1</name><description>Digital-to-analog converter</description><baseAddress>0x40007400</baseAddress><groupName>DAC</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM6_DAC</name><value>54</value></interrupt><registers><register><name>CR</name><description>control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAUDRIE2</name><description>DAC channel2 DMA underrun interrupt enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMAEN2</name><description>DAC channel2 DMA enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MAMP2</name><description>DAC channel2 mask/amplitude selector</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>WAVE2</name><description>DAC channel2 noise/triangle wave generation enable</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TSEL2</name><description>DAC channel2 trigger selection</description><bitOffset>19</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>TEN2</name><description>DAC channel2 trigger enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BOFF2</name><description>DAC channel2 output buffer disable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN2</name><description>DAC channel2 enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMAUDRIE1</name><description>DAC channel1 DMA Underrun Interrupt enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMAEN1</name><description>DAC channel1 DMA enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MAMP1</name><description>DAC channel1 mask/amplitude selector</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>WAVE1</name><description>DAC channel1 noise/triangle wave generation enable</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TSEL1</name><description>DAC channel1 trigger selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>TEN1</name><description>DAC channel1 trigger enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BOFF1</name><description>DAC channel1 output buffer disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EN1</name><description>DAC channel1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>SWTRIGR</name><description>software trigger register</description><addressOffset>0x4</addressOffset><size>32</size><access>write-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SWTRIG2</name><description>DAC channel2 software trigger</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SWTRIG1</name><description>DAC channel1 software trigger</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field></fields></register><register><name>DHR12R1</name><description>channel1 12-bit right-aligned data holding register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>DHR12L1</name><description>channel1 12-bit left aligned data holding register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>DHR8R1</name><description>channel1 8-bit right aligned data holding register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register><register><name>DHR12R2</name><description>channel2 12-bit right aligned data holding register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>DHR12L2</name><description>channel2 12-bit left aligned data holding register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>DHR8R2</name><description>channel2 8-bit right-aligned data holding register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register><register><name>DHR12RD</name><description>Dual DAC 12-bit right-aligned data holding register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned data</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>DHR12LD</name><description>DUAL DAC 12-bit left aligned data holding register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned data</description><bitOffset>20</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>DHR8RD</name><description>DUAL DAC 8-bit right aligned data holding register</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned data</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register><register><name>DOR1</name><description>channel1 data output register</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC1DOR</name><description>DAC channel1 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-only</access></field></fields></register><register><name>DOR2</name><description>channel2 data output register</description><addressOffset>0x30</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DACC2DOR</name><description>DAC channel2 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-only</access></field></fields></register><register><name>SR</name><description>status register</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAUDR2</name><description>DAC channel2 DMA underrun flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMAUDR1</name><description>DAC channel1 DMA underrun flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>PWR</name><description>Power control</description><baseAddress>0x40007000</baseAddress><groupName>PWR</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>PVD</name><value>1</value></interrupt><registers><register><name>CR</name><description>power control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FPDS</name><description>Flash power down in Stop mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBP</name><description>Disable backup domain write protection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLS</name><description>PVD level selection</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PVDE</name><description>Power voltage detector enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSBF</name><description>Clear standby flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CWUF</name><description>Clear wakeup flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PDDS</name><description>Power down deepsleep</description><bitOffset>