Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LPDS</name><description>Low-power deep sleep</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CSR</name><description>power control/status register</description><addressOffset>0x4</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>WUF</name><description>Wakeup flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SBF</name><description>Standby flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVDO</name><description>PVD output</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BRR</name><description>Backup regulator ready</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWUP</name><description>Enable WKUP pin</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BRE</name><description>Backup regulator enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VOSRDY</name><description>Regulator voltage scaling output selection ready bit</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>I2C3</name><description>Inter-integrated circuit</description><baseAddress>0x40005C00</baseAddress><groupName>I2C</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>I2C3_EV</name><value>72</value></interrupt><interrupt><name>I2C3_ER</name><value>73</value></interrupt><registers><register><name>CR1</name><description>Control register 1</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SWRST</name><description>Software reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALERT</name><description>SMBus alert</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PEC</name><description>Packet error checking</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>POS</name><description>Acknowledge/PEC Position (for data reception)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>Acknowledge enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STOP</name><description>Stop generation</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>START</name><description>Start generation</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NOSTRETCH</name><description>Clock stretching disable (Slave mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENGC</name><description>General call enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENPEC</name><description>PEC enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENARP</name><description>ARP enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SMBTYPE</name><description>SMBus type</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SMBUS</name><description>SMBus mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PE</name><description>Peripheral enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CR2</name><description>Control register 2</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>LAST</name><description>DMA last transfer</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DMAEN</name><description>DMA requests enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITBUFEN</name><description>Buffer interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITEVTEN</name><description>Event interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITERREN</name><description>Error interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FREQ</name><description>Peripheral clock frequency</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth><access>read-write</access></field></fields></register><register><name>OAR1</name><description>Own address register 1</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>ADDMODE</name><description>Addressing mode (slave mode)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADD10</name><description>Interface address</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ADD7</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ADD0</name><description>Interface address</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OAR2</name><description>Own address register 2</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>ADD2</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ENDUAL</name><description>Dual addressing mode enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DR</name><description>Data register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DR</name><description>8-bit data register</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register><register><name>SR1</name><description>Status register 1</description><addressOffset>0x14</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SMBALERT</name><description>SMBus alert</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIMEOUT</name><description>Timeout or Tlow error</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PECERR</name><description>PEC Error in reception</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OVR</name><description>Overrun/Underrun</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AF</name><description>Acknowledge failure</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ARLO</name><description>Arbitration lost (master mode)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Bus error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TxE</name><description>Data register empty (transmitters)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RxNE</name><description>Data register not empty (receivers)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STOPF</name><description>Stop detection (slave mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADD10</name><description>10-bit header sent (Master mode)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BTF</name><description>Byte transfer finished</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADDR</name><description>Address sent (master mode)/matched (slave mode)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SB</name><description>Start bit (Master mode)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>SR2</name><description>Status register 2</description><addressOffset>0x18</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PEC</name><description>acket error checking register</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DUALF</name><description>Dual flag (Slave mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SMBHOST</name><description>SMBus host header (Slave mode)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SMBDEFAULT</name><description>SMBus device default address (Slave mode)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GENCALL</name><description>General call address (Slave mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TRA</name><description>Transmitter/receiver</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BUSY</name><description>Bus busy</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MSL</name><description>Master/slave</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CCR</name><description>Clock control register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>F_S</name><description>I2C master mode selection</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DUTY</name><description>Fast mode duty cycle</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCR</name><description>Clock control register in Fast/Standard mode (Master mode)</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>TRISE</name><description>TRISE register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x2</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TRISE</name><description>Maximum rise time in Fast/Standard mode (Master mode)</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral derivedFrom="I2C3"><name>I2C2</name><baseAddress>0x40005800</baseAddress><groupName>I2C2</groupName><interrupt><name>I2C2_EV</name><value>33</value></interrupt><interrupt><name>I2C2_ER</name><value>34</value></interrupt></peripheral><peripheral derivedFrom="I2C3"><name>I2C1</name><baseAddress>0x40005400</baseAddress><groupName>I2C1</groupName><interrupt><name>I2C1_EV</name><value>31</value></interrupt><interrupt><name>I2C1_ER</name><value>32</value></interrupt></peripheral><peripheral><name>IWDG</name><description>Independent watchdog</description><baseAddress>0x40003000</baseAddress><groupName>IWDG</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>KR</name><description>Key register</description><addressOffset>0x0</addressOffset><size>32</size><access>write-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>KEY</name><description>Key value (write only, read 0000h)</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>write-only</access></field></fields></register><register><name>PR</name><description>Prescaler register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PR</name><description>Prescaler divider</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field></fields></register><register><name>RLR</name><description>Reload register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0xFFF</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RL</name><description>Watchdog counter reload value</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>SR</name><description>Status register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RVU</name><description>Watchdog counter reload value update</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVU</name><description>Watchdog prescaler value update</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral><name>WWDG</name><description>Window watchdog</description><baseAddress>0x40002C00</baseAddress><groupName>WWDG</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>WWDG</name><value>0</value></interrupt><registers><register><name>CR</name><description>Control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x7F</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>WDGA</name><description>Activation bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>T</name><description>7-bit counter (MSB to LSB)</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field></fields></register><register><name>CFR</name><description>Configuration register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x7F</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EWI</name><description>Early wakeup interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDGTB1</name><description>Timer base</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDGTB0</name><description>Timer base</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>W</name><description>7-bit window value</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field></fields></register><register><name>SR</name><description>Status register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EWIF</name><description>Early wakeup interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>RTC</name><description>Real-time clock</description><baseAddress>0x40002800</baseAddress><groupName>RTC</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RTC_WKUP</name><value>3</value></interrupt><interrupt><name>RTC_Alarm</name><value>41</value></interrupt><registers><register><name>TR</name><description>time register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PM</name><description>AM/PM notation</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HT</name><description>Hour tens in BCD format</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>HU</name><description>Hour units in BCD format</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>MNT</name><description>Minute tens in BCD format</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MNU</name><description>Minute units in BCD format</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>ST</name><description>Second tens in BCD format</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>SU</name><description>Second units in BCD format</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>DR</name><description>date register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x2101</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>YT</name><description>Year tens in BCD format</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>YU</name><description>Year units in BCD format</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>WDU</name><description>Week day units</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MT</name><description>Month tens in BCD format</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MU</name><description>Month units in BCD format</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>DT</name><description>Date tens in BCD format</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DU</name><description>Date units in BCD format</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>CR</name><description>control register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>COE</name><description>Calibration output enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OSEL</name><description>Output selection</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>POL</name><description>Output polarity</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BKP</name><description>Backup</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SUB1H</name><description>Subtract 1 hour (winter time change)</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADD1H</name><description>Add 1 hour (summer time change)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSIE</name><description>Time-stamp interrupt enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WUTIE</name><description>Wakeup timer interrupt enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRBIE</name><description>Alarm B interrupt enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRAIE</name><description>Alarm A interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSE</name><description>Time stamp enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WUTE</name><description>Wakeup timer enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRBE</name><description>Alarm B enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRAE</name><description>Alarm A enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCE</name><description>Coarse digital calibration enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMT</name><description>Hour format</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>REFCKON</name><description>Reference clock detection enable (50 or 60 Hz)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSEDGE</name><description>Time-stamp event active edge</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WCKSEL</name><description>Wakeup clock selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field></fields></register><register><name>ISR</name><description>initialization and status register</description><addressOffset>0xC</addressOffset><size>32</size><resetValue>0x7</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>ALRAWF</name><description>Alarm A write flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ALRBWF</name><description>Alarm B write flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>WUTWF</name><description>Wakeup timer write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SHPF</name><description>Shift operation pending</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INITS</name><description>Initialization status flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access