Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
Offset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GRSTCTL</name><description>OTG_FS reset register (OTG_FS_GRSTCTL)</description><addressOffset>0x10</addressOffset><size>32</size><resetValue>0x20000000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CSRST</name><description>Core soft reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSRST</name><description>HCLK soft reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FCRST</name><description>Host frame counter reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFFLSH</name><description>RxFIFO flush</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFFLSH</name><description>TxFIFO flush</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>6</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>AHBIDL</name><description>AHB master idle</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>FS_GINTSTS</name><description>OTG_FS core interrupt register (OTG_FS_GINTSTS)</description><addressOffset>0x14</addressOffset><size>32</size><resetValue>0x4000020</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CMOD</name><description>Current mode of operation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MMIS</name><description>Mode mismatch interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGINT</name><description>OTG interrupt</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SOF</name><description>Start of frame</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFLVL</name><description>RxFIFO non-empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NPTXFE</name><description>Non-periodic TxFIFO empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GINAKEFF</name><description>Global IN non-periodic NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GOUTNAKEFF</name><description>Global OUT NAK effective</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ESUSP</name><description>Early suspend</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBSUSP</name><description>USB suspend</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBRST</name><description>USB reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENUMDNE</name><description>Enumeration done</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ISOODRP</name><description>Isochronous OUT packet dropped interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOPF</name><description>End of periodic frame interrupt</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IEPINT</name><description>IN endpoint interrupt</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OEPINT</name><description>OUT endpoint interrupt</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IISOIXFR</name><description>Incomplete isochronous IN transfer</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IPXFR_INCOMPISOOUT</name><description>Incomplete periodic transfer(Host mode)/Incomplete isochronous OUT transfer(Device mode)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HPRTINT</name><description>Host port interrupt</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HCINT</name><description>Host channels interrupt</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PTXFE</name><description>Periodic TxFIFO empty</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CIDSCHG</name><description>Connector ID status change</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCINT</name><description>Disconnect detected interrupt</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRQINT</name><description>Session request/new session detected interrupt</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUPINT</name><description>Resume/remote wakeup detected interrupt</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GINTMSK</name><description>OTG_FS interrupt mask register (OTG_FS_GINTMSK)</description><addressOffset>0x18</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MMISM</name><description>Mode mismatch interrupt mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGINT</name><description>OTG interrupt mask</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SOFM</name><description>Start of frame mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFLVLM</name><description>Receive FIFO non-empty mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NPTXFEM</name><description>Non-periodic TxFIFO empty mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GINAKEFFM</name><description>Global non-periodic IN NAK effective mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GONAKEFFM</name><description>Global OUT NAK effective mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ESUSPM</name><description>Early suspend mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBSUSPM</name><description>USB suspend mask</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBRST</name><description>USB reset mask</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENUMDNEM</name><description>Enumeration done mask</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ISOODRPM</name><description>Isochronous OUT packet dropped interrupt mask</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOPFM</name><description>End of periodic frame interrupt mask</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPMISM</name><description>Endpoint mismatch interrupt mask</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IEPINT</name><description>IN endpoints interrupt mask</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OEPINT</name><description>OUT endpoints interrupt mask</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IISOIXFRM</name><description>Incomplete isochronous IN transfer mask</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IPXFRM_IISOOXFRM</name><description>Incomplete periodic transfer mask(Host mode)/Incomplete isochronous OUT transfer mask(Device mode)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRTIM</name><description>Host port interrupt mask</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HCIM</name><description>Host channels interrupt mask</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTXFEM</name><description>Periodic TxFIFO empty mask</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIDSCHGM</name><description>Connector ID status change mask</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCINT</name><description>Disconnect detected interrupt mask</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRQIM</name><description>Session request/new session detected interrupt mask</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WUIM</name><description>Resume/remote wakeup detected interrupt mask</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GRXSTSR_Device</name><description>OTG_FS Receive status debug read(Device mode)</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth><access>read-only</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>FRMNUM</name><description>Frame number</description><bitOffset>21</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field></fields></register><register><name>FS_GRXSTSR_Host</name><description>OTG_FS Receive status debug read(Host mode)</description><alternateRegister>FS_GRXSTSR_Device</alternateRegister><addressOffset>0x1C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth><access>read-only</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>FRMNUM</name><description>Frame number</description><bitOffset>21</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field></fields></register><register><name>FS_GRXFSIZ</name><description>OTG_FS Receive FIFO size register (OTG_FS_GRXFSIZ)</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RXFD</name><description>RxFIFO depth</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GNPTXFSIZ_Device</name><description>OTG_FS non-periodic transmit FIFO size register (Device mode)</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TX0FSA</name><description>Endpoint 0 transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>TX0FD</name><description>Endpoint 0 TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GNPTXFSIZ_Host</name><description>OTG_FS non-periodic transmit FIFO size register (Host mode)</description><alternateRegister>FS_GNPTXFSIZ_Device</alternateRegister><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NPTXFSA</name><description>Non-periodic transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>NPTXFD</name><description>Non-periodic TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_GNPTXSTS</name><description>OTG_FS non-periodic transmit FIFO/queue status register (OTG_FS_GNPTXSTS)</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-only</access><resetValue>0x80200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NPTXFSAV</name><description>Non-periodic TxFIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field><field><name>NPTQXSAV</name><description>Non-periodic transmit request queue space available</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>NPTXQTOP</name><description>Top of the non-periodic transmit request queue</description><bitOffset>24</bitOffset><bitWidth>7</bitWidth><access>read-only</access></field></fields></register><register><name>FS_GCCFG</name><description>OTG_FS general core configuration register (OTG_FS_GCCFG)</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PWRDWN</name><description>Power down</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VBUSASEN</name><description>Enable the VBUS sensing device</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VBUSBSEN</name><description>Enable the VBUS sensing device</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SOFOUTEN</name><description>SOF output enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_CID</name><description>core ID register</description><addressOffset>0x3C</addressOffset><size>32</size><access>read-write</access><resetValue>0x1000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRODUCT_ID</name><description>Product ID field</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HPTXFSIZ</name><description>OTG_FS Host periodic transmit FIFO size register (OTG_FS_HPTXFSIZ)</description><addressOffset>0x100</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000600</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PTXSA</name><description>Host periodic TxFIFO start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>PTXFSIZ</name><description>Host periodic TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_DIEPTXF1</name><description>OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF2)</description><addressOffset>0x104</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFO2 transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_DIEPTXF2</name><description>OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF3)</description><addressOffset>0x108</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFO3 transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_DIEPTXF3</name><description>OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF4)</description><addressOffset>0x10C</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFO4 transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>OTG_FS_HOST</name><description>USB on the go full speed</description><baseAddress>0x50000400</baseAddress><groupName>USB_OTG_FS</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>FS_HCFG</name><description>OTG_FS host configuration register (OTG_FS_HCFG)</description><addressOffset>0x0</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FSLSPCS</name><description>FS/LS PHY clock select</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>FSLSS</name><description>FS- and LS-only support</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>HFIR</name><description>OTG_FS Host frame interval register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0xEA60</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FRIVL</name><description>Frame interval</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HFNUM</name><description>OTG_FS host frame number/frame time remaining register (OTG_FS_HFNUM)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-only</access><resetValue>0x3FFF</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FRNUM</name><description>Frame number</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field><field><name>FTREM</name><description>Frame time remaining</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>FS_HPTXSTS</name><description>OTG_FS_Host periodic transmit FIFO/queue status register (OTG_FS_HPTXSTS)</description><addressOffset>0x10</addressOffset><size>32</size><resetValue>0x80100</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PTXFSAVL</name><description>Periodic transmit data FIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>PTXQSAV</name><description>Periodic transmit request queue space available</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>PTXQTOP</name><description>Top of the periodic transmit request queue</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field></fields></register><register><name>HAINT</name><description>OTG_FS Host all channels interrupt register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>HAINT</name><description>Channel interrupts</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>HAINTMSK</name><description>OTG_FS host all channels interrupt mask register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>HAINTM</name><description>Channel interrupt mask</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HPRT</name><description>OTG_FS host port control and status register (OTG_FS_HPRT)</description><addressOffset>0x40</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PCSTS</name><description>Port connect status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PCDET</name><description>Port connect detected</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PENA</name><description>Port enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PENCHNG</name><description>Port enable/disable change</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>POCA</name><description>Port overcurrent active</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>POCCHNG</name><description>Port overcurrent change</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRES</name><description>Port resume</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PSUSP</name><description>Port suspend</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRST</name><description>Port reset</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLSTS</name><description>Port line status</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PPWR</name><description>Port power</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTC