Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
TL</name><description>Port test control</description><bitOffset>13</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PSPD</name><description>Port speed</description><bitOffset>17</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>FS_HCCHAR0</name><description>OTG_FS host channel-0 characteristics register (OTG_FS_HCCHAR0)</description><addressOffset>0x100</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCCHAR1</name><description>OTG_FS host channel-1 characteristics register (OTG_FS_HCCHAR1)</description><addressOffset>0x120</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCCHAR2</name><description>OTG_FS host channel-2 characteristics register (OTG_FS_HCCHAR2)</description><addressOffset>0x140</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCCHAR3</name><description>OTG_FS host channel-3 characteristics register (OTG_FS_HCCHAR3)</description><addressOffset>0x160</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCCHAR4</name><description>OTG_FS host channel-4 characteristics register (OTG_FS_HCCHAR4)</description><addressOffset>0x180</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCCHAR5</name><description>OTG_FS host channel-5 characteristics register (OTG_FS_HCCHAR5)</description><addressOffset>0x1A0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCCHAR6</name><description>OTG_FS host channel-6 characteristics register (OTG_FS_HCCHAR6)</description><addressOffset>0x1C0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCCHAR7</name><description>OTG_FS host channel-7 characteristics register (OTG_FS_HCCHAR7)</description><addressOffset>0x1E0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multicount</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT0</name><description>OTG_FS host channel-0 interrupt register (OTG_FS_HCINT0)</description><addressOffset>0x108</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT1</name><description>OTG_FS host channel-1 interrupt register (OTG_FS_HCINT1)</description><addressOffset>0x128</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT2</name><description>OTG_FS host channel-2 interrupt register (OTG_FS_HCINT2)</description><addressOffset>0x148</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT3</name><description>OTG_FS host channel-3 interrupt register (OTG_FS_HCINT3)</description><addressOffset>0x168</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT4</name><description>OTG_FS host channel-4 interrupt register (OTG_FS_HCINT4)</description><addressOffset>0x188</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT5</name><description>OTG_FS host channel-5 interrupt register (OTG_FS_HCINT5)</description><addressOffset>0x1A8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><acces