Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
s>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT6</name><description>OTG_FS host channel-6 interrupt register (OTG_FS_HCINT6)</description><addressOffset>0x1C8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINT7</name><description>OTG_FS host channel-7 interrupt register (OTG_FS_HCINT7)</description><addressOffset>0x1E8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK0</name><description>OTG_FS host channel-0 mask register (OTG_FS_HCINTMSK0)</description><addressOffset>0x10C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK1</name><description>OTG_FS host channel-1 mask register (OTG_FS_HCINTMSK1)</description><addressOffset>0x12C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK2</name><description>OTG_FS host channel-2 mask register (OTG_FS_HCINTMSK2)</description><addressOffset>0x14C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK3</name><description>OTG_FS host channel-3 mask register (OTG_FS_HCINTMSK3)</description><addressOffset>0x16C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK4</name><description>OTG_FS host channel-4 mask register (OTG_FS_HCINTMSK4)</description><addressOffset>0x18C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK5</name><description>OTG_FS host channel-5 mask register (OTG_FS_HCINTMSK5)</description><addressOffset>0x1AC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK6</name><description>OTG_FS host channel-6 mask register (OTG_FS_HCINTMSK6)</description><addressOffset>0x1CC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCINTMSK7</name><description>OTG_FS host channel-7 mask register (OTG_FS_HCINTMSK7)</description><addressOffset>0x1EC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ0</name><description>OTG_FS host channel-0 transfer size register</description><addressOffset>0x110</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ1</name><description>OTG_FS host channel-1 transfer size register</description><addressOffset>0x130</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ2</name><description>OTG_FS host channel-2 transfer size register</description><addressOffset>0x150</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ3</name><description>OTG_FS host channel-3 transfer size register</description><addressOffset>0x170</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ4</name><description>OTG_FS host channel-x transfer size register</description><addressOffset>0x190</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ5</name><description>OTG_FS host channel-5 transfer size register</description><addressOffset>0x1B0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ6</name><description>OTG_FS host channel-6 transfer size register</description><addressOffset>0x1D0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>FS_HCTSIZ7</name><description>OTG_FS host channel-7 transfer size register<