Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
et><bitWidth>1</bitWidth><access>write-only</access></field><field><name>Stall</name><description>Stall</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>SNPM</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>EPTYP</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NAKSTS</name><description>NAKSTS</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EONUM_DPID</name><description>EONUM/DPID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USBAEP</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MPSIZ</name><description>MPSIZ</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT0</name><description>device endpoint-x interrupt register</description><addressOffset>0x108</addressOffset><size>32</size><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT1</name><description>device endpoint-1 interrupt register</description><addressOffset>0x128</addressOffset><size>32</size><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT2</name><description>device endpoint-2 interrupt register</description><addressOffset>0x148</addressOffset><size>32</size><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPINT3</name><description>device endpoint-3 interrupt register</description><addressOffset>0x168</addressOffset><size>32</size><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TXFE</name><description>TXFE</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INEPNE</name><description>INEPNE</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>ITTXFE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>TOC</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPINT0</name><description>device endpoint-0 interrupt register</description><addressOffset>0x308</addressOffset><size>32</size><access>read-write</access><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPINT1</name><description>device endpoint-1 interrupt register</description><addressOffset>0x328</addressOffset><size>32</size><access>read-write</access><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPINT2</name><description>device endpoint-2 interrupt register</description><addressOffset>0x348</addressOffset><size>32</size><access>read-write</access><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPINT3</name><description>device endpoint-3 interrupt register</description><addressOffset>0x368</addressOffset><size>32</size><access>read-write</access><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>B2BSTUP</name><description>B2BSTUP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OTEPDIS</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>STUP</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>EPDISD</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRC</name><description>XFRC</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPTSIZ0</name><description>device endpoint-0 transfer size register</description><addressOffset>0x110</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPTSIZ0</name><description>device OUT endpoint-0 transfer size register</description><addressOffset>0x310</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>STUPCNT</name><description>SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPTSIZ1</name><description>device endpoint-1 transfer size register</description><addressOffset>0x130</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPTSIZ2</name><description>device endpoint-2 transfer size register</description><addressOffset>0x150</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field></fields></register><register><name>DIEPTSIZ3</name><description>device endpoint-3 transfer size register</description><addressOffset>0x170</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field></fields></register><register><name>DTXFSTS0</name><description>OTG_FS device IN endpoint transmit FIFO status register</description><addressOffset>0x118</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>DTXFSTS1</name><description>OTG_FS device IN endpoint transmit FIFO status register</description><addressOffset>0x138</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>DTXFSTS2</name><description>OTG_FS device IN endpoint transmit FIFO status register</description><addressOffset>0x158</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>DTXFSTS3</name><description>OTG_FS device IN endpoint transmit FIFO status register</description><addressOffset>0x178</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>DOEPTSIZ1</name><description>device OUT endpoint-1 transfer size register</description><addressOffset>0x330</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPTSIZ2</name><description>device OUT endpoint-2 transfer size register</description><addressOffset>0x350</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field></fields></register><register><name>DOEPTSIZ3</name><description>device OUT endpoint-3 transfer size register</description><addressOffset>0x370</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>OTG_FS_PWRCLK</name><description>USB on the go full speed</description><baseAddress>0x50000E00</baseAddress><groupName>USB_OTG_FS</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>FS_PCGCCTL</name><description>OTG_FS power and clock gating control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>STPPCLK</name><description>Stop PHY clock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GATEHCLK</name><description>Gate HCLK</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PHYSUSP</name><description>PHY Suspended</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>CAN1</name><description>Controller area network</description><baseAddress>0x40006400</baseAddress><groupName>CAN</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>CAN1_TX</name><value>19</value></interrupt><interrupt><name>CAN1_RX0</name><value>20</value></interrupt><interrupt><name>CAN1_RX1</name><value>21</value></interrupt><interrupt><name>CAN1_SCE</name><value>22</value></interrupt><registers><register><name>MCR</name><description>master control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x10002</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DBF</name><description>DBF</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RESET</name><description>RESET</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TTCM</name><description>TTCM</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABOM</name><description>ABOM</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AWUM</name><description>AWUM</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NART</name><description>NART</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RFLM</name><description>RFLM</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFP</name><description>TXFP</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLEEP</name><description>SLEEP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INRQ</name><description>INRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>MSR</name><description>master status register</description><addressOffset>0x4</addressOffset><size>32</size><resetValue>0xC02</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RX</name><description>RX</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SAMP</name><description>SAMP</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXM</name><description>RXM</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXM</name><description>TXM</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SLAKI</name><description>SLAKI</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUI</name><description>WKUI</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRI</name><description>ERRI</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLAK</name><description>SLAK</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INAK</name><description>INAK</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>TSR</name><description>transmit status register</description><addressOffset>0x8</addressOffset><size>32</size><resetValue>0x1C000000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>LOW2</name><description>Lowest priority flag for mailbox 2</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW1</name><description>Lowest priority flag for mailbox 1</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW0</name><description>Lowest priority flag for mailbox 0</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME2</name><description>Lowest priority flag for mailbox 2</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME1</name><description>Lowest priority flag for mailbox 1</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME0</name><description>Lowest priority flag for mailbox 0</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CODE</name><description>CODE</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>ABRQ2</name><description>ABRQ2</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR2</name><description>TERR2</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST2</name><description>ALST2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK2</name><description>TXOK2</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP2</name><description>RQCP2</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ1</name><description>ABRQ1</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR1</name><description>TERR1</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST1</name><description>ALST1</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK1</name><description>TXOK1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP1</name><description>RQCP1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ0</name><description>ABRQ0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR0</name>