Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
/value></interrupt></peripheral><peripheral><name>FLASH</name><description>FLASH</description><baseAddress>0x40023C00</baseAddress><groupName>FLASH</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>FLASH</name><value>4</value></interrupt><registers><register><name>ACR</name><description>Flash access control register</description><addressOffset>0x0</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>LATENCY</name><description>Latency</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PRFTEN</name><description>Prefetch enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ICEN</name><description>Instruction cache enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCEN</name><description>Data cache enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ICRST</name><description>Instruction cache reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>DCRST</name><description>Data cache reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>KEYR</name><description>Flash key register</description><addressOffset>0x4</addressOffset><size>32</size><access>write-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>KEY</name><description>FPEC key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>write-only</access></field></fields></register><register><name>OPTKEYR</name><description>Flash option key register</description><addressOffset>0x8</addressOffset><size>32</size><access>write-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OPTKEY</name><description>Option byte key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>write-only</access></field></fields></register><register><name>SR</name><description>Status register</description><addressOffset>0xC</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EOP</name><description>End of operation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OPERR</name><description>Operation error</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WRPERR</name><description>Write protection error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGAERR</name><description>Programming alignment error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGPERR</name><description>Programming parallelism error</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGSERR</name><description>Programming sequence error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BSY</name><description>Busy</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CR</name><description>Control register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x80000000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PG</name><description>Programming</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SER</name><description>Sector Erase</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MER</name><description>Mass Erase</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SNB</name><description>Sector number</description><bitOffset>3</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PSIZE</name><description>Program size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>STRT</name><description>Start</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOPIE</name><description>End of operation interrupt enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LOCK</name><description>Lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OPTCR</name><description>Flash option control register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x14</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>OPTLOCK</name><description>Option lock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OPTSTRT</name><description>Option start</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BOR_LEV</name><description>BOR reset Level</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>WDG_SW</name><description>WDG_SW User option bytes</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>nRST_STOP</name><description>nRST_STOP User option bytes</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>nRST_STDBY</name><description>nRST_STDBY User option bytes</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RDP</name><description>Read protect</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>nWRP</name><description>Not write protect</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>EXTI</name><description>External interrupt/event controller</description><baseAddress>0x40013C00</baseAddress><groupName>EXTI</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TAMP_STAMP</name><value>2</value></interrupt><interrupt><name>EXTI0</name><value>6</value></interrupt><interrupt><name>EXTI1</name><value>7</value></interrupt><interrupt><name>EXTI2</name><value>8</value></interrupt><interrupt><name>EXTI3</name><value>9</value></interrupt><interrupt><name>EXTI4</name><value>10</value></interrupt><interrupt><name>EXTI9_5</name><value>23</value></interrupt><interrupt><name>EXTI15_10</name><value>40</value></interrupt><registers><register><name>IMR</name><description>Interrupt mask register (EXTI_IMR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MR0</name><description>Interrupt Mask on line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR1</name><description>Interrupt Mask on line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR2</name><description>Interrupt Mask on line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR3</name><description>Interrupt Mask on line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR4</name><description>Interrupt Mask on line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR5</name><description>Interrupt Mask on line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR6</name><description>Interrupt Mask on line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR7</name><description>Interrupt Mask on line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR8</name><description>Interrupt Mask on line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR9</name><description>Interrupt Mask on line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR10</name><description>Interrupt Mask on line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR11</name><description>Interrupt Mask on line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR12</name><description>Interrupt Mask on line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR13</name><description>Interrupt Mask on line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR14</name><description>Interrupt Mask on line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR15</name><description>Interrupt Mask on line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR16</name><description>Interrupt Mask on line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR17</name><description>Interrupt Mask on line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR18</name><description>Interrupt Mask on line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR19</name><description>Interrupt Mask on line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR20</name><description>Interrupt Mask on line 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR21</name><description>Interrupt Mask on line 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR22</name><description>Interrupt Mask on line 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>EMR</name><description>Event mask register (EXTI_EMR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MR0</name><description>Event Mask on line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR1</name><description>Event Mask on line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR2</name><description>Event Mask on line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR3</name><description>Event Mask on line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR4</name><description>Event Mask on line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR5</name><description>Event Mask on line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR6</name><description>Event Mask on line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR7</name><description>Event Mask on line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR8</name><description>Event Mask on line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR9</name><description>Event Mask on line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR10</name><description>Event Mask on line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR11</name><description>Event Mask on line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR12</name><description>Event Mask on line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR13</name><description>Event Mask on line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR14</name><description>Event Mask on line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR15</name><description>Event Mask on line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR16</name><description>Event Mask on line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR17</name><description>Event Mask on line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR18</name><description>Event Mask on line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR19</name><description>Event Mask on line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR20</name><description>Event Mask on line 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR21</name><description>Event Mask on line 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MR22</name><description>Event Mask on line 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>RTSR</name><description>Rising Trigger selection register (EXTI_RTSR)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TR0</name><description>Rising trigger event configuration of line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR1</name><description>Rising trigger event configuration of line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR2</name><description>Rising trigger event configuration of line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR3</name><description>Rising trigger event configuration of line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR4</name><description>Rising trigger event configuration of line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR5</name><description>Rising trigger event configuration of line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR6</name><description>Rising trigger event configuration of line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR7</name><description>Rising trigger event configuration of line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR8</name><description>Rising trigger event configuration of line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR9</name><description>Rising trigger event configuration of line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR10</name><description>Rising trigger event configuration of line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR11</name><description>Rising trigger event configuration of line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR12</name><description>Rising trigger event configuration of line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR13</name><description>Rising trigger event configuration of line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR14</name><description>Rising trigger event configuration of line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR15</name><description>Rising trigger event configuration of line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR16</name><description>Rising trigger event configuration of line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR17</name><description>Rising trigger event configuration of line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR18</name><description>Rising trigger event configuration of line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR19</name><description>Rising trigger event configuration of line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR20</name><description>Rising trigger event configuration of line 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR21</name><description>Rising trigger event configuration of line 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR22</name><description>Rising trigger event configuration of line 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FTSR</name><description>Falling Trigger selection register (EXTI_FTSR)</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TR0</name><description>Falling trigger event configuration of line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR1</name><description>Falling trigger event configuration of line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR2</name><description>Falling trigger event configuration of line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR3</name><description>Falling trigger event configuration of line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR4</name><description>Falling trigger event configuration of line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR5</name><description>Falling trigger event configuration of line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR6</name><description>Falling trigger event configuration of line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR7</name><description>Falling trigger event configuration of line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR8</name><description>Falling trigger event configuration of line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR9</name><description>Falling trigger event configuration of line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR10</name><description>Falling trigger event configuration of line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR11</name><description>Falling trigger event configuration of line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR12</name><description>Falling trigger event configuration of line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR13</name><description>Falling trigger event configuration of line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR14</name><description>Falling trigger event configuration of line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR15</name><description>Falling trigger event configuration of line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR16</name><description>Falling trigger event configuration of line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR17</name><description>Falling trigger event configuration of line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR18</name><description>Falling trigger event configuration of line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR19</name><description>Falling trigger event configuration of line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR20</name><description>Falling trigger event configuration of line 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR21</name><description>Falling trigger event configuration of line 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TR22</name><description>Falling trigger event configuration of line 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>SWIER</name><description>Software interrupt event register (EXTI_SWIER)</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SWIER0</name><description>Software Interrupt on line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER1</na