Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
me><description>Software Interrupt on line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER2</name><description>Software Interrupt on line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER3</name><description>Software Interrupt on line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER4</name><description>Software Interrupt on line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER5</name><description>Software Interrupt on line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER6</name><description>Software Interrupt on line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER7</name><description>Software Interrupt on line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER8</name><description>Software Interrupt on line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER9</name><description>Software Interrupt on line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER10</name><description>Software Interrupt on line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER11</name><description>Software Interrupt on line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER12</name><description>Software Interrupt on line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER13</name><description>Software Interrupt on line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER14</name><description>Software Interrupt on line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER15</name><description>Software Interrupt on line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER16</name><description>Software Interrupt on line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER17</name><description>Software Interrupt on line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER18</name><description>Software Interrupt on line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER19</name><description>Software Interrupt on line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER20</name><description>Software Interrupt on line 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER21</name><description>Software Interrupt on line 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWIER22</name><description>Software Interrupt on line 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>PR</name><description>Pending register (EXTI_PR)</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PR0</name><description>Pending bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR1</name><description>Pending bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR2</name><description>Pending bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR3</name><description>Pending bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR4</name><description>Pending bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR5</name><description>Pending bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR6</name><description>Pending bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR7</name><description>Pending bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR8</name><description>Pending bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR9</name><description>Pending bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR10</name><description>Pending bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR11</name><description>Pending bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR12</name><description>Pending bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR13</name><description>Pending bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR14</name><description>Pending bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR15</name><description>Pending bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR16</name><description>Pending bit 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR17</name><description>Pending bit 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR18</name><description>Pending bit 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR19</name><description>Pending bit 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR20</name><description>Pending bit 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR21</name><description>Pending bit 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PR22</name><description>Pending bit 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>OTG_HS_GLOBAL</name><description>USB on the go high speed</description><baseAddress>0x40040000</baseAddress><groupName>USB_OTG_HS</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>OTG_HS_EP1_OUT</name><value>74</value></interrupt><interrupt><name>OTG_HS_EP1_IN</name><value>75</value></interrupt><interrupt><name>OTG_HS_WKUP</name><value>76</value></interrupt><interrupt><name>OTG_HS</name><value>77</value></interrupt><registers><register><name>OTG_HS_GOTGCTL</name><description>OTG_HS control and status register</description><addressOffset>0x0</addressOffset><size>32</size><resetValue>0x800</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SRQSCS</name><description>Session request success</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SRQ</name><description>Session request</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HNGSCS</name><description>Host negotiation success</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HNPRQ</name><description>HNP request</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSHNPEN</name><description>Host set HNP enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DHNPEN</name><description>Device HNP enabled</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIDSTS</name><description>Connector ID status</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DBCT</name><description>Long/short debounce time</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ASVLD</name><description>A-session valid</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BSVLD</name><description>B-session valid</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_GOTGINT</name><description>OTG_HS interrupt register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SEDET</name><description>Session end detected</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRSSCHG</name><description>Session request success status change</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HNSSCHG</name><description>Host negotiation success status change</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HNGDET</name><description>Host negotiation detected</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADTOCHG</name><description>A-device timeout change</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBCDNE</name><description>Debounce done</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GAHBCFG</name><description>OTG_HS AHB configuration register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>GINT</name><description>Global interrupt mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HBSTLEN</name><description>Burst length/type</description><bitOffset>1</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>DMAEN</name><description>DMA enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFELVL</name><description>TxFIFO empty level</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTXFELVL</name><description>Periodic TxFIFO empty level</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GUSBCFG</name><description>OTG_HS USB configuration register</description><addressOffset>0xC</addressOffset><size>32</size><resetValue>0xA00</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TOCAL</name><description>FS timeout calibration</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PHYSEL</name><description>USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SRPCAP</name><description>SRP-capable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HNPCAP</name><description>HNP-capable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRDT</name><description>USB turnaround time</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PHYLPCS</name><description>PHY Low-power clock select</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ULPIFSLS</name><description>ULPI FS/LS select</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ULPIAR</name><description>ULPI Auto-resume</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ULPICSM</name><description>ULPI Clock SuspendM</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ULPIEVBUSD</name><description>ULPI External VBUS Drive</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ULPIEVBUSI</name><description>ULPI external VBUS indicator</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSDPS</name><description>TermSel DLine pulsing selection</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PCCI</name><description>Indicator complement</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTCI</name><description>Indicator pass through</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ULPIIPD</name><description>ULPI interface protect disable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FHMOD</name><description>Forced host mode</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FDMOD</name><description>Forced peripheral mode</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTXPKT</name><description>Corrupt Tx packet</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GRSTCTL</name><description>OTG_HS reset register</description><addressOffset>0x10</addressOffset><size>32</size><resetValue>0x20000000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CSRST</name><description>Core soft reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSRST</name><description>HCLK soft reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FCRST</name><description>Host frame counter reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFFLSH</name><description>RxFIFO flush</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFFLSH</name><description>TxFIFO flush</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>6</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>DMAREQ</name><description>DMA request signal</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>AHBIDL</name><description>AHB master idle</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_GINTSTS</name><description>OTG_HS core interrupt register</description><addressOffset>0x14</addressOffset><size>32</size><resetValue>0x4000020</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CMOD</name><description>Current mode of operation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MMIS</name><description>Mode mismatch interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGINT</name><description>OTG interrupt</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SOF</name><description>Start of frame</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFLVL</name><description>RxFIFO nonempty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NPTXFE</name><description>Nonperiodic TxFIFO empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GINAKEFF</name><description>Global IN nonperiodic NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BOUTNAKEFF</name><description>Global OUT NAK effective</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ESUSP</name><description>Early suspend</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBSUSP</name><description>USB suspend</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBRST</name><description>USB reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENUMDNE</name><description>Enumeration done</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ISOODRP</name><description>Isochronous OUT packet dropped interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOPF</name><description>End of periodic frame interrupt</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IEPINT</name><description>IN endpoint interrupt</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OEPINT</name><description>OUT endpoint interrupt</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IISOIXFR</name><description>Incomplete isochronous IN transfer</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PXFR_INCOMPISOOUT</name><description>Incomplete periodic transfer</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DATAFSUSP</name><description>Data fetch suspended</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HPRTINT</name><description>Host port interrupt</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HCINT</name><description>Host channels interrupt</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PTXFE</name><description>Periodic TxFIFO empty</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CIDSCHG</name><description>Connector ID status change</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCINT</name><description>Disconnect detected interrupt</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRQINT</name><description>Session request/new session detected interrupt</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUINT</name><description>Resume/remote wakeup detected interrupt</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GINTMSK</name><description>OTG_HS interrupt mask register</description><addressOffset>0x18</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MMISM</name><description>Mode mismatch interrupt mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTGINT</name><description>OTG interrupt mask</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SOFM</name><description>Start of frame mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXFLVLM</name><description>Receive FIFO nonempty mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NPTXFEM</name><description>Nonperiodic TxFIFO empty mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GINAKEFFM</name><description>Global nonperiodic IN NAK effective mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GONAKEFFM</name><description>Global OUT NAK effective mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ESUSPM</name><description>Early suspend mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBSUSPM</name><description>USB suspend mask</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USBRST</name><description>USB reset mask</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENUMDNEM</name><description>Enumeration done mask</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ISOODRPM</name><description>Isochronous OUT packet dropped interrupt mask</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOPFM</name><description>End of periodic frame interrupt mask</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPMISM</name><description>Endpoint mismatch interrupt mask</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IEPINT</name><description>IN endpoints interrupt mask</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OEPINT</name><description>OUT endpoints interrupt mask</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IISOIXFRM</name><description>Incomplete isochronous IN transfer mask</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PXFRM_IISOOXFRM</name><description>Incomplete periodic transfer mask</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FSUSPM</name><description>Data fetch suspended mask</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRTIM</name><description>Host port interrupt mask<