Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
/description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HCIM</name><description>Host channels interrupt mask</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTXFEM</name><description>Periodic TxFIFO empty mask</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CIDSCHGM</name><description>Connector ID status change mask</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DISCINT</name><description>Disconnect detected interrupt mask</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SRQIM</name><description>Session request/new session detected interrupt mask</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WUIM</name><description>Resume/remote wakeup detected interrupt mask</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GRXSTSR_Host</name><description>OTG_HS Receive status debug read register (host mode)</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHNUM</name><description>Channel number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth><access>read-only</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_GRXSTSP_Host</name><description>OTG_HS status read and pop register (host mode)</description><addressOffset>0x20</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>CHNUM</name><description>Channel number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth><access>read-only</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_GRXFSIZ</name><description>OTG_HS Receive FIFO size register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RXFD</name><description>RxFIFO depth</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GNPTXFSIZ_Host</name><description>OTG_HS nonperiodic transmit FIFO size register (host mode)</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NPTXFSA</name><description>Nonperiodic transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>NPTXFD</name><description>Nonperiodic TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_TX0FSIZ_Peripheral</name><description>Endpoint 0 transmit FIFO size (peripheral mode)</description><alternateRegister>OTG_HS_GNPTXFSIZ_Host</alternateRegister><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>TX0FSA</name><description>Endpoint 0 transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>TX0FD</name><description>Endpoint 0 TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GNPTXSTS</name><description>OTG_HS nonperiodic transmit FIFO/queue status register</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-only</access><resetValue>0x80200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NPTXFSAV</name><description>Nonperiodic TxFIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field><field><name>NPTQXSAV</name><description>Nonperiodic transmit request queue space available</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>NPTXQTOP</name><description>Top of the nonperiodic transmit request queue</description><bitOffset>24</bitOffset><bitWidth>7</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_GCCFG</name><description>OTG_HS general core configuration register</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PWRDWN</name><description>Power down</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CPADEN</name><description>Enable I2C bus connection for the external I2C PHY interface</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VBUSASEN</name><description>Enable the VBUS sensing device</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VBUSBSEN</name><description>Enable the VBUS sensing device</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SOFOUTEN</name><description>SOF output enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NOVBUSSENS</name><description>VBUS sensing disable option</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_CID</name><description>OTG_HS core ID register</description><addressOffset>0x3C</addressOffset><size>32</size><access>read-write</access><resetValue>0x1200</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRODUCT_ID</name><description>Product ID field</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HPTXFSIZ</name><description>OTG_HS Host periodic transmit FIFO size register</description><addressOffset>0x100</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000600</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PTXSA</name><description>Host periodic TxFIFO start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>PTXFD</name><description>Host periodic TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTXF1</name><description>OTG_HS device IN endpoint transmit FIFO size register</description><addressOffset>0x104</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFOx transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTXF2</name><description>OTG_HS device IN endpoint transmit FIFO size register</description><addressOffset>0x108</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFOx transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTXF3</name><description>OTG_HS device IN endpoint transmit FIFO size register</description><addressOffset>0x11C</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFOx transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTXF4</name><description>OTG_HS device IN endpoint transmit FIFO size register</description><addressOffset>0x120</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFOx transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTXF5</name><description>OTG_HS device IN endpoint transmit FIFO size register</description><addressOffset>0x124</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFOx transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTXF6</name><description>OTG_HS device IN endpoint transmit FIFO size register</description><addressOffset>0x128</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFOx transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTXF7</name><description>OTG_HS device IN endpoint transmit FIFO size register</description><addressOffset>0x12C</addressOffset><size>32</size><access>read-write</access><resetValue>0x2000400</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXSA</name><description>IN endpoint FIFOx transmit RAM start address</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>INEPTXFD</name><description>IN endpoint TxFIFO depth</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_GRXSTSR_Peripheral</name><description>OTG_HS Receive status debug read register (peripheral mode mode)</description><alternateRegister>OTG_HS_GRXSTSR_Host</alternateRegister><addressOffset>0x1C</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth><access>read-only</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>FRMNUM</name><description>Frame number</description><bitOffset>21</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_GRXSTSP_Peripheral</name><description>OTG_HS status read and pop register (peripheral mode)</description><alternateRegister>OTG_HS_GRXSTSP_Host</alternateRegister><addressOffset>0x20</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>BCNT</name><description>Byte count</description><bitOffset>4</bitOffset><bitWidth>11</bitWidth><access>read-only</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PKTSTS</name><description>Packet status</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>FRMNUM</name><description>Frame number</description><bitOffset>21</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral><name>OTG_HS_HOST</name><description>USB on the go high speed</description><baseAddress>0x40040400</baseAddress><groupName>USB_OTG_HS</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>OTG_HS_HCFG</name><description>OTG_HS host configuration register</description><addressOffset>0x0</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FSLSPCS</name><description>FS/LS PHY clock select</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>FSLSS</name><description>FS- and LS-only support</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_HFIR</name><description>OTG_HS Host frame interval register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0xEA60</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FRIVL</name><description>Frame interval</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>RLDCTRL</name><description>Reload control</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HFNUM</name><description>OTG_HS host frame number/frame time remaining register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-only</access><resetValue>0x3FFF</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>FRNUM</name><description>Frame number</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field><field><name>FTREM</name><description>Frame time remaining</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_HPTXSTS</name><description>OTG_HS_Host periodic transmit FIFO/queue status register</description><addressOffset>0x10</addressOffset><size>32</size><resetValue>0x80100</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PTXFSAVL</name><description>Periodic transmit data FIFO space available</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>PTXQSAV</name><description>Periodic transmit request queue space available</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>PTXQTOP</name><description>Top of the periodic transmit request queue</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_HAINT</name><description>OTG_HS Host all channels interrupt register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>HAINT</name><description>Channel interrupts</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_HAINTMSK</name><description>OTG_HS host all channels interrupt mask register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>HAINTM</name><description>Channel interrupt mask</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HPRT</name><description>OTG_HS host port control and status register</description><addressOffset>0x40</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PCSTS</name><description>Port connect status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PCDET</name><description>Port connect detected</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PENA</name><description>Port enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PENCHNG</name><description>Port enable/disable change</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>POCA</name><description>Port overcurrent active</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>POCCHNG</name><description>Port overcurrent change</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRES</name><description>Port resume</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PSUSP</name><description>Port suspend</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRST</name><description>Port reset</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLSTS</name><description>Port line status</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>PPWR</name><description>Port power</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTCTL</name><description>Port test control</description><bitOffset>13</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PSPD</name><description>Port speed</description><bitOffset>17</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_HCCHAR0</name><description>OTG_HS host channel-0 characteristics register</description><addressOffset>0x100</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR1</name><description>OTG_HS host channel-1 characteristics register</description><addressOffset>0x120</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR2</name><description>OTG_HS host channel-2 characteristics register</description><addressOffset>0x140</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>