Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR3</name><description>OTG_HS host channel-3 characteristics register</description><addressOffset>0x160</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR4</name><description>OTG_HS host channel-4 characteristics register</description><addressOffset>0x180</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR5</name><description>OTG_HS host channel-5 characteristics register</description><addressOffset>0x1A0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR6</name><description>OTG_HS host channel-6 characteristics register</description><addressOffset>0x1C0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR7</name><description>OTG_HS host channel-7 characteristics register</description><addressOffset>0x1E0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR8</name><description>OTG_HS host channel-8 characteristics register</description><addressOffset>0x200</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR9</name><description>OTG_HS host channel-9 characteristics register</description><addressOffset>0x220</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR10</name><description>OTG_HS host channel-10 characteristics register</description><addressOffset>0x240</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR11</name><description>OTG_HS host channel-11 characteristics register</description><addressOffset>0x260</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR12</name><description>OTG_HS host channel-12 characteristics register</description><addressOffset>0x280</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR13</name><description>OTG_HS host channel-13 characteristics register</description><addressOffset>0x2A0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR14</name><description>OTG_HS host channel-14 characteristics register</description><addressOffset>0x2C0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCCHAR15</name><description>OTG_HS host channel-15 characteristics register</description><addressOffset>0x2E0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EPNUM</name><description>Endpoint number</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>EPDIR</name><description>Endpoint direction</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSDEV</name><description>Low-speed device</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi Count (MC) / Error Count (EC)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth><access