Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>22</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>ODDFRM</name><description>Odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHDIS</name><description>Channel disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHENA</name><description>Channel enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT0</name><description>OTG_HS host channel-0 split control register</description><addressOffset>0x104</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT1</name><description>OTG_HS host channel-1 split control register</description><addressOffset>0x124</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT2</name><description>OTG_HS host channel-2 split control register</description><addressOffset>0x144</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT3</name><description>OTG_HS host channel-3 split control register</description><addressOffset>0x164</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT4</name><description>OTG_HS host channel-4 split control register</description><addressOffset>0x184</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT5</name><description>OTG_HS host channel-5 split control register</description><addressOffset>0x1A4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT6</name><description>OTG_HS host channel-6 split control register</description><addressOffset>0x1C4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT7</name><description>OTG_HS host channel-7 split control register</description><addressOffset>0x1E4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT8</name><description>OTG_HS host channel-8 split control register</description><addressOffset>0x204</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT9</name><description>OTG_HS host channel-9 split control register</description><addressOffset>0x224</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT10</name><description>OTG_HS host channel-10 split control register</description><addressOffset>0x244</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT11</name><description>OTG_HS host channel-11 split control register</description><addressOffset>0x264</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT12</name><description>OTG_HS host channel-12 split control register</description><addressOffset>0x284</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT13</name><description>OTG_HS host channel-13 split control register</description><addressOffset>0x2A4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT14</name><description>OTG_HS host channel-14 split control register</description><addressOffset>0x2C4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCSPLT15</name><description>OTG_HS host channel-15 split control register</description><addressOffset>0x2E4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>PRTADDR</name><description>Port address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>HUBADDR</name><description>Hub address</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>XACTPOS</name><description>XACTPOS</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMPLSPLT</name><description>Do complete split</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPLITEN</name><description>Split enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINT0</name><description>OTG_HS host channel-11 interrupt register</description><addressOffset>0x108</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINT1</name><description>OTG_HS host channel-1 interrupt register</description><addressOffset>0x128</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERR</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>Response received interrupt</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINT2</name><description>OTG_HS host channel-2 interrupt register</description><addressOffset>0x148</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERR</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>Response received interrupt</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR</name><description>Frame overrun</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERR</name><description>Data toggle error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINT3</name><description>OTG_HS host channel-3 interrupt register</description><addressOffset>0x168</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHH</name><description>Channel halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERR</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALL</name><description>STALL response received interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK response received interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACK</name><description>ACK response received/transmitted interrupt</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>Response received interrupt</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERR</name><description>Transaction error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERR</name><description>Babble err