Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
scription>OTG_HS host channel-11 interrupt mask register</description><addressOffset>0x10C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK1</name><description>OTG_HS host channel-1 interrupt mask register</description><addressOffset>0x12C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK2</name><description>OTG_HS host channel-2 interrupt mask register</description><addressOffset>0x14C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK3</name><description>OTG_HS host channel-3 interrupt mask register</description><addressOffset>0x16C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK4</name><description>OTG_HS host channel-4 interrupt mask register</description><addressOffset>0x18C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK5</name><description>OTG_HS host channel-5 interrupt mask register</description><addressOffset>0x1AC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK6</name><description>OTG_HS host channel-6 interrupt mask register</description><addressOffset>0x1CC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK7</name><description>OTG_HS host channel-7 interrupt mask register</description><addressOffset>0x1EC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK8</name><description>OTG_HS host channel-8 interrupt mask register</description><addressOffset>0x20C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK9</name><description>OTG_HS host channel-9 interrupt mask register</description><addressOffset>0x22C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK10</name><description>OTG_HS host channel-10 interrupt mask register</description><addressOffset>0x24C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK11</name><description>OTG_HS host channel-11 interrupt mask register</description><addressOffset>0x26C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMOR