Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
M</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK12</name><description>OTG_HS host channel-12 interrupt mask register</description><addressOffset>0x28C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK13</name><description>OTG_HS host channel-13 interrupt mask register</description><addressOffset>0x2AC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK14</name><description>OTG_HS host channel-14 interrupt mask register</description><addressOffset>0x2CC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCINTMSK15</name><description>OTG_HS host channel-15 interrupt mask register</description><addressOffset>0x2EC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHHM</name><description>Channel halted mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AHBERRM</name><description>AHB error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STALLM</name><description>STALL response received interrupt mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK response received interrupt mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACKM</name><description>ACK response received/transmitted interrupt mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>response received interrupt mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXERRM</name><description>Transaction error mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BBERRM</name><description>Babble error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FRMORM</name><description>Frame overrun mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DTERRM</name><description>Data toggle error mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ0</name><description>OTG_HS host channel-11 transfer size register</description><addressOffset>0x110</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ1</name><description>OTG_HS host channel-1 transfer size register</description><addressOffset>0x130</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ2</name><description>OTG_HS host channel-2 transfer size register</description><addressOffset>0x150</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ3</name><description>OTG_HS host channel-3 transfer size register</description><addressOffset>0x170</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ4</name><description>OTG_HS host channel-4 transfer size register</description><addressOffset>0x190</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ5</name><description>OTG_HS host channel-5 transfer size register</description><addressOffset>0x1B0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ6</name><description>OTG_HS host channel-6 transfer size register</description><addressOffset>0x1D0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ7</name><description>OTG_HS host channel-7 transfer size register</description><addressOffset>0x1F0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ8</name><description>OTG_HS host channel-8 transfer size register</description><addressOffset>0x210</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ9</name><description>OTG_HS host channel-9 transfer size register</description><addressOffset>0x230</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ10</name><description>OTG_HS host channel-10 transfer size register</description><addressOffset>0x250</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ11</name><description>OTG_HS host channel-11 transfer size register</description><addressOffset>0x270</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ12</name><description>OTG_HS host channel-12 transfer size register</description><addressOffset>0x290</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ13</name><description>OTG_HS host channel-13 transfer size register</description><addressOffset>0x2B0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ14</name><description>OTG_HS host channel-14 transfer size register</description><addressOffset>0x2D0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCTSIZ15</name><description>OTG_HS host channel-15 transfer size register</description><addressOffset>0x2F0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>DPID</name><description>Data PID</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA0</name><description>OTG_HS host channel-0 DMA address register</description><addressOffset>0x114</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA1</name><description>OTG_HS host channel-1 DMA address register</description><addressOffset>0x134</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA2</name><description>OTG_HS host channel-2 DMA address register</description><addressOffset>0x154</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA3</name><description>OTG_HS host channel-3 DMA address register</description><addressOffset>0x174</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA4</name><description>OTG_HS host channel-4 DMA address register</description><addressOffset>0x194</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA5</name><description>OTG_HS host channel-5 DMA address register</description><addressOffset>0x1B4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA6</name><description>OTG_HS host channel-6 DMA address register</description><addressOffset>0x1D4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA7</name><description>OTG_HS host channel-7 DMA address register</description><addressOffset>0x1F4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA8</name><description>OTG_HS host channel-8 DMA address register</description><addressOffset>0x214</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA9</name><description>OTG_HS host channel-9 DMA address register</description><addressOffset>0x234</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</acces