Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
s></field></fields></register><register><name>OTG_HS_HCDMA10</name><description>OTG_HS host channel-10 DMA address register</description><addressOffset>0x254</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA11</name><description>OTG_HS host channel-11 DMA address register</description><addressOffset>0x274</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA12</name><description>OTG_HS host channel-12 DMA address register</description><addressOffset>0x294</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA13</name><description>OTG_HS host channel-13 DMA address register</description><addressOffset>0x2B4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA14</name><description>OTG_HS host channel-14 DMA address register</description><addressOffset>0x2D4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_HCDMA15</name><description>OTG_HS host channel-15 DMA address register</description><addressOffset>0x2F4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>OTG_HS_DEVICE</name><description>USB on the go high speed</description><baseAddress>0x40040800</baseAddress><groupName>USB_OTG_HS</groupName><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>OTG_HS_DCFG</name><description>OTG_HS device configuration register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x2200000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DSPD</name><description>Device speed</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>NZLSOHSK</name><description>Nonzero-length status OUT handshake</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAD</name><description>Device address</description><bitOffset>4</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>PFIVL</name><description>Periodic (micro)frame interval</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PERSCHIVL</name><description>Periodic scheduling interval</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DCTL</name><description>OTG_HS device control register</description><addressOffset>0x4</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>RWUSIG</name><description>Remote wakeup signaling</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SDIS</name><description>Soft disconnect</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GINSTS</name><description>Global IN NAK status</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>GONSTS</name><description>Global OUT NAK status</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TCTL</name><description>Test control</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>SGINAK</name><description>Set global IN NAK</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CGINAK</name><description>Clear global IN NAK</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SGONAK</name><description>Set global OUT NAK</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CGONAK</name><description>Clear global OUT NAK</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>POPRGDNE</name><description>Power-on programming done</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DSTS</name><description>OTG_HS device status register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-only</access><resetValue>0x10</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>SUSPSTS</name><description>Suspend status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ENUMSPD</name><description>Enumerated speed</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>EERR</name><description>Erratic error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FNSOF</name><description>Frame number of the received SOF</description><bitOffset>8</bitOffset><bitWidth>14</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DIEPMSK</name><description>OTG_HS device IN endpoint common interrupt mask register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed interrupt mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDM</name><description>Endpoint disabled interrupt mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOM</name><description>Timeout condition mask (nonisochronous endpoints)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFEMSK</name><description>IN token received when TxFIFO empty mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNMM</name><description>IN token received with EP mismatch mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNEM</name><description>IN endpoint NAK effective mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFURM</name><description>FIFO underrun mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BIM</name><description>BNA interrupt mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPMSK</name><description>OTG_HS device OUT endpoint common interrupt mask register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed interrupt mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDM</name><description>Endpoint disabled interrupt mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUPM</name><description>SETUP phase done mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDM</name><description>OUT token received when endpoint disabled mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OPEM</name><description>OUT packet error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BOIM</name><description>BNA interrupt mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DAINT</name><description>OTG_HS device all endpoints interrupt register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>IEPINT</name><description>IN endpoint interrupt bits</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field><field><name>OEPINT</name><description>OUT endpoint interrupt bits</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DAINTMSK</name><description>OTG_HS all endpoints interrupt mask register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>IEPM</name><description>IN EP interrupt mask bits</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>OEPM</name><description>OUT EP interrupt mask bits</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DVBUSDIS</name><description>OTG_HS device VBUS discharge time register</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x17D7</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>VBUSDT</name><description>Device VBUS discharge time</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DVBUSPULSE</name><description>OTG_HS device VBUS pulsing time register</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access><resetValue>0x5B8</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DVBUSP</name><description>Device VBUS pulsing time</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DTHRCTL</name><description>OTG_HS Device threshold control register</description><addressOffset>0x30</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>NONISOTHREN</name><description>Nonisochronous IN endpoints threshold enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ISOTHREN</name><description>ISO IN endpoint threshold enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXTHRLEN</name><description>Transmit threshold length</description><bitOffset>2</bitOffset><bitWidth>9</bitWidth><access>read-write</access></field><field><name>RXTHREN</name><description>Receive threshold enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXTHRLEN</name><description>Receive threshold length</description><bitOffset>17</bitOffset><bitWidth>9</bitWidth><access>read-write</access></field><field><name>ARPEN</name><description>Arbiter parking enable</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPEMPMSK</name><description>OTG_HS device IN endpoint FIFO empty interrupt mask register</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTXFEM</name><description>IN EP Tx FIFO empty interrupt mask bits</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DEACHINT</name><description>OTG_HS device each endpoint interrupt register</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>IEP1INT</name><description>IN endpoint 1interrupt bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OEP1INT</name><description>OUT endpoint 1 interrupt bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DEACHINTMSK</name><description>OTG_HS device each endpoint interrupt register mask</description><addressOffset>0x3C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>IEP1INTM</name><description>IN Endpoint 1 interrupt mask bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OEP1INTM</name><description>OUT Endpoint 1 interrupt mask bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPEACHMSK1</name><description>OTG_HS device each in endpoint-1 interrupt register</description><addressOffset>0x44</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed interrupt mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDM</name><description>Endpoint disabled interrupt mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOM</name><description>Timeout condition mask (nonisochronous endpoints)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFEMSK</name><description>IN token received when TxFIFO empty mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNMM</name><description>IN token received with EP mismatch mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNEM</name><description>IN endpoint NAK effective mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFURM</name><description>FIFO underrun mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BIM</name><description>BNA interrupt mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK interrupt mask</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPEACHMSK1</name><description>OTG_HS device each OUT endpoint-1 interrupt register</description><addressOffset>0x84</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRCM</name><description>Transfer completed interrupt mask</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDM</name><description>Endpoint disabled interrupt mask</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOM</name><description>Timeout condition mask</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFEMSK</name><description>IN token received when TxFIFO empty mask</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNMM</name><description>IN token received with EP mismatch mask</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNEM</name><description>IN endpoint NAK effective mask</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFURM</name><description>OUT packet error mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BIM</name><description>BNA interrupt mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERRM</name><description>Bubble error interrupt mask</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAKM</name><description>NAK interrupt mask</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYETM</name><description>NYET interrupt mask</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL0</name><description>OTG device endpoint-0 control register</description><addressOffset>0x100</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL1</name><description>OTG device endpoint-1 control register</description><addressOffset>0x120</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL2</name><description>OTG device endpoint-2 control register</description><addressOffset>0x140</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</