Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL3</name><description>OTG device endpoint-3 control register</description><addressOffset>0x160</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL4</name><description>OTG device endpoint-4 control register</description><addressOffset>0x180</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL5</name><description>OTG device endpoint-5 control register</description><addressOffset>0x1A0</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL6</name><description>OTG device endpoint-6 control register</description><addressOffset>0x1C0</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPCTL7</name><description>OTG device endpoint-7 control register</description><addressOffset>0x1E0</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even/odd frame</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFNUM</name><description>TxFIFO number</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT0</name><description>OTG device endpoint-0 interrupt register</description><addressOffset>0x108</addressOffset><size>32</size><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT1</name><description>OTG device endpoint-1 interrupt register</description><addressOffset>0x128</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT2</name><description>OTG device endpoint-2 interrupt register</description><addressOffset>0x148</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT3</name><description>OTG device endpoint-3 interrupt register</description><addressOffset>0x168</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT4</name><description>OTG device endpoint-4 interrupt register</description><addressOffset>0x188</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT5</name><description>OTG device endpoint-5 interrupt register</description><addressOffset>0x1A8</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT6</name><description>OTG device endpoint-6 interrupt register</description><addressOffset>0x1C8</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidt