Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
h><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPINT7</name><description>OTG device endpoint-7 interrupt register</description><addressOffset>0x1E8</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TOC</name><description>Timeout condition</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ITTXFE</name><description>IN token received when TxFIFO is empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INEPNE</name><description>IN endpoint NAK effective</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFE</name><description>Transmit FIFO empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXFIFOUDRN</name><description>Transmit Fifo Underrun</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BNA</name><description>Buffer not available interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PKTDRPSTS</name><description>Packet dropped status</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Babble error interrupt</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NAK</name><description>NAK interrupt</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTSIZ0</name><description>OTG_HS device IN endpoint 0 transfer size register</description><addressOffset>0x110</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPDMA1</name><description>OTG_HS device endpoint-1 DMA address register</description><addressOffset>0x114</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPDMA2</name><description>OTG_HS device endpoint-2 DMA address register</description><addressOffset>0x134</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPDMA3</name><description>OTG_HS device endpoint-3 DMA address register</description><addressOffset>0x154</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPDMA4</name><description>OTG_HS device endpoint-4 DMA address register</description><addressOffset>0x174</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPDMA5</name><description>OTG_HS device endpoint-5 DMA address register</description><addressOffset>0x194</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>DMAADDR</name><description>DMA address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DTXFSTS0</name><description>OTG_HS device IN endpoint transmit FIFO status register</description><addressOffset>0x118</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space avail</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DTXFSTS1</name><description>OTG_HS device IN endpoint transmit FIFO status register</description><addressOffset>0x138</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space avail</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DTXFSTS2</name><description>OTG_HS device IN endpoint transmit FIFO status register</description><addressOffset>0x158</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space avail</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DTXFSTS3</name><description>OTG_HS device IN endpoint transmit FIFO status register</description><addressOffset>0x178</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space avail</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DTXFSTS4</name><description>OTG_HS device IN endpoint transmit FIFO status register</description><addressOffset>0x198</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space avail</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DTXFSTS5</name><description>OTG_HS device IN endpoint transmit FIFO status register</description><addressOffset>0x1B8</addressOffset><size>32</size><access>read-only</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>INEPTFSAV</name><description>IN endpoint TxFIFO space avail</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field></fields></register><register><name>OTG_HS_DIEPTSIZ1</name><description>OTG_HS device endpoint transfer size register</description><addressOffset>0x130</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTSIZ2</name><description>OTG_HS device endpoint transfer size register</description><addressOffset>0x150</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTSIZ3</name><description>OTG_HS device endpoint transfer size register</description><addressOffset>0x170</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTSIZ4</name><description>OTG_HS device endpoint transfer size register</description><addressOffset>0x190</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DIEPTSIZ5</name><description>OTG_HS device endpoint transfer size register</description><addressOffset>0x1B0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>MCNT</name><description>Multi count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPCTL0</name><description>OTG_HS device control OUT endpoint 0 control register</description><addressOffset>0x300</addressOffset><size>32</size><resetValue>0x8000</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>SNPM</name><description>Snoop mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field></fields></register><register><name>OTG_HS_DOEPCTL1</name><description>OTG device endpoint-1 control register</description><addressOffset>0x320</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even odd frame/Endpoint data PID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>Snoop mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID/Set even frame</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPCTL2</name><description>OTG device endpoint-2 control register</description><addressOffset>0x340</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even odd frame/Endpoint data PID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>Snoop mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID/Set even frame</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPCTL3</name><description>OTG device endpoint-3 control register</description><addressOffset>0x360</addressOffset><size>32</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>MPSIZ</name><description>Maximum packet size</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>USBAEP</name><description>USB active endpoint</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EONUM_DPID</name><description>Even odd frame/Endpoint data PID</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NAKSTS</name><description>NAK status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPTYP</name><description>Endpoint type</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SNPM</name><description>Snoop mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>Stall</name><description>STALL handshake</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CNAK</name><description>Clear NAK</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SNAK</name><description>Set NAK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SD0PID_SEVNFRM</name><description>Set DATA0 PID/Set even frame</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SODDFRM</name><description>Set odd frame</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>EPDIS</name><description>Endpoint disable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPENA</name><description>Endpoint enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT0</name><description>OTG_HS device endpoint-0 interrupt register</description><addressOffset>0x308</addressOffset><size>32</size><access>read-write</access><resetValue>0x80</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT1</name><description>OTG_HS device endpoint-1 interrupt register</description><addressOffset>0x328</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT2</name><description>OTG_HS device endpoint-2 interrupt register</description><addressOffset>0x348</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><fi