Alan-Jowett/HardwareAbstractionIR/evidence/st/stm32f405rgt6/generated/stm32f405rgt6.svd
eld><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT3</name><description>OTG_HS device endpoint-3 interrupt register</description><addressOffset>0x368</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT4</name><description>OTG_HS device endpoint-4 interrupt register</description><addressOffset>0x388</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT5</name><description>OTG_HS device endpoint-5 interrupt register</description><addressOffset>0x3A8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT6</name><description>OTG_HS device endpoint-6 interrupt register</description><addressOffset>0x3C8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPINT7</name><description>OTG_HS device endpoint-7 interrupt register</description><addressOffset>0x3E8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRC</name><description>Transfer completed interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPDISD</name><description>Endpoint disabled interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUP</name><description>SETUP phase done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OTEPDIS</name><description>OUT token received when endpoint disabled</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>B2BSTUP</name><description>Back-to-back SETUP packets received</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NYET</name><description>NYET interrupt</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPTSIZ0</name><description>OTG_HS device endpoint-1 transfer size register</description><addressOffset>0x310</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STUPCNT</name><description>SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPTSIZ1</name><description>OTG_HS device endpoint-2 transfer size register</description><addressOffset>0x330</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPTSIZ2</name><description>OTG_HS device endpoint-3 transfer size register</description><addressOffset>0x350</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPTSIZ3</name><description>OTG_HS device endpoint-4 transfer size register</description><addressOffset>0x370</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>OTG_HS_DOEPTSIZ4</name><description>OTG_HS device endpoint-5 transfer size register</description><addressOffset>0x390</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>XFRSIZ</name><description>Transfer size</description><bitOffset>0</bitOffset><bitWidth>19</bitWidth><access>read-write</access></field><field><name>PKTCNT</name><description>Packet count</description><bitOffset>19</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>RXDPID_STUPCNT</name><description>Received data PID/SETUP packet count</description><bitOffset>29</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>OTG_HS_PWRCLK</name><description>USB on the go high speed</description><baseAddress>0x40040E00</baseAddress><groupName>USB_OTG_HS</groupName><addressBlock><offset>0x0</offset><size>0x3F200</size><usage>registers</usage></addressBlock><registers><register><name>OTG_HS_PCGCR</name><description>Power and clock gating control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><fields><field><name>STPPCLK</name><description>Stop PHY clock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GATEHCLK</name><description>Gate HCLK</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PHYSUSP</name><description>PHY suspended</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral></peripherals></device>